{
    "RECIPES":[
       [
          {
             "id":"snow golem",
             "desc":"A snow golem can be created by placing a pumpkin on top of  two snow blocks on the ground."
          }
       ],
       [
          {
             "id":"pillar quartz block",
             "desc":"A pillar of quartz can be obtained by placing a block of quartz on top of a block of quartz in mine craft."
          }
       ],
       [
          {
             "id":"firework rocket",
             "desc":"A firework rocket can be crafted by placing a firework star in the left middle square, a piece of paper in the center square, and gunpowder in the right middle square in a crafting table. Similar to a firework star, a firework rocket can have more gunpowder added in the bottom row to increase the duration of a rocket."
          }
       ],
       [
          {
             "id":"rabbit stew",
             "desc":"Rabbit stew can be crafted by placing cooked rabbit in the top middle square a carrot in the middle left square a baked potato in the center square any type of mushroom in the middle right square and a bowl in the bottom middle square."
          }
       ],
       [
          {
             "id":"cauldron",
             "desc":"A cauldron can be created by placing iron ingots in all squares but the top middle and very center squares in a crafting table."
          }
       ],
       [
          {
             "id":"stone shovel",
             "desc":"All types of shovels can be crafted by placing the desired material in the top middle square, and then sticks in the two squares directly beneath that in a crafting table."
          }
       ],
       [
          {
             "id":"red carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"book and quill",
             "desc":"A book and quill can be crafted by placing a book in the middle left square, an ink sac in the very center square, and a feather in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"item frame",
             "desc":"An item frame can be crafted by placing leather in the very center square, and eight sticks surrounding it."
          }
       ],
       [
          {
             "id":"map",
             "desc":"A map can be crafted by placing a compass in the middle square and eight pieces of paper surrounding it."
          }
       ],
       [
          {
             "id":"sticky piston",
             "desc":"A sticky piston can be crafted by placing a slime ball on top of a piston in a crafting window"
          }
       ],
       [
          {
             "id":"bread",
             "desc":"Bread can be crafted by placing three wheat across a row in a crafting table."
          }
       ],
       [
          {
             "id":"wooden pick ax",
             "desc":"All types of pick axs can be crafted by placing three of the desired material across the top row, and then placing sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"shears",
             "desc":"Shears can be crafted by placing two Iron Ingots diagonal from each other."
          }
       ],
       [
          {
             "id":"raw beef",
             "desc":"Raw Beef will drop from the death of a Cow or Moo shrooms."
          }
       ],
       [
          {
             "id":"smooth red sandstone",
             "desc":"Smooth red sandstone can be crafted by placing four red sandstone in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"prismarine crystals",
             "desc":"Prismarine Crystals can be obtained by defeating Guardians and Elder Guardians."
          }
       ],
       [
          {
             "id":"oak wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"wooden sword",
             "desc":"All types of swords can be crafted by placing the desired material in the top middle and very center square, with a stick beneath them, in a crafting table"
          }
       ],
       [
          {
             "id":"stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"jungle fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"activator rail",
             "desc":"An activator rail can be crafted by placing a red stone torch in the very center square, sticks above and beneath it, and then six iron ingots in the remaining squares in a crafting table."
          }
       ],
       [
          {
             "id":"farmland",
             "desc":"Farmland can be created by plowing the land with a hoe."
          }
       ],
       [
          {
             "id":"gold ore",
             "desc":"Gold ore can be obtained by breaking gold ore blocks with an iron pick ax or better"
          }
       ],
       [
          {
             "id":"andesite",
             "desc":"Andesite can be mined with a pick ax or crafted by placing diorite next to cobblestone in a crafting table."
          }
       ],
       [
          {
             "id":"rose red",
             "desc":"Rose red can be crafted by placing a poppy into a crafting table."
          }
       ],
       [
          {
             "id":"iron axe",
             "desc":"All types of axes can be crafted by placing three of the desired material in the top left, top middle, and middle left squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"light blue dye",
             "desc":"Light blue dye can be crafted by placing lapis lazuli next to bone meal in a crafting window."
          }
       ],
       [
          {
             "id":"gray dye",
             "desc":"Gray dye can be crafted by placing bonemeal next to an ink sac in a crafting window"
          }
       ],
       [
          {
             "id":"blue stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"iron horse armor",
             "desc":"Horse Armor can be randomly found in Dungeons, Nether fortresses, Village blacksmiths, jungle temples, desert temples, and stronghold chests."
          }
       ],
       [
          {
             "id":"red stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"brick stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"golden leggings",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"dark oak fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"wither mob head",
             "desc":"Mob heads can be obtained by having a charged creeper blow up the mob whose head you want to obtain."
          }
       ],
       [
          {
             "id":"spider eye",
             "desc":"A spider eye is randomly dropped by killing spiders or witches."
          }
       ],
       [
          {
             "id":"magenta stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"brown stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"pumpkin pie",
             "desc":"A pumpkin pie can be crafted by placing a pumpkin in the left middle square, sugar in the very center square, and an egg in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"snowball",
             "desc":"A snowball can be obtained by breaking snow with a shovel."
          }
       ],
       [
          {
             "id":"juke box",
             "desc":"A juke box is crafted by placing a diamond in the very center square and wood planks all around that in a crafting table"
          }
       ],
       [
          {
             "id":"sand",
             "desc":"Sand can be obtained by breaking sand blocks."
          }
       ],
       [
          {
             "id":"dead bush",
             "desc":"Dead bushes, also known as shrubs, can be obtained with shears."
          }
       ],
       [
          {
             "id":"brick slab",
             "desc":"A brick slab can be crafted by placing three brick blocks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"lily pad",
             "desc":"Lily pads can be found naturally on water in swamplands or underground lakes."
          }
       ],
       [
          {
             "id":"leather pants",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"mossy cobblestone wall",
             "desc":"A mossy cobblestone wall is crafted by placing six mossy cobblestone across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"eleven disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chests."
          }
       ],
       [
          {
             "id":"purple stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"magenta stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"mall disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chests."
          }
       ],
       [
          {
             "id":"jungle wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"diamond ax",
             "desc":"All types of axes can be crafted by placing three of the desired material in the top left, top middle, and middle left squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"empty map",
             "desc":"A map can be crafted by placing a compass in the middle square and eight pieces of paper surrounding it."
          }
       ],
       [
          {
             "id":"stone pressure plate",
             "desc":"A stone pressure plate can be crafted by placing two smooth stone, next to each other, horizontally, in a crafting window."
          }
       ],
       [
          {
             "id":"trapdoor",
             "desc":"Trapdoors can be crafted with either wooden planks or iron ingots. To craft a wooden trapdoor, place wooden planks in all spaces in the bottom two rows. To craft an iron trapdoor, place iron ingots in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"gold boots",
             "desc":"All boots are crafted by placing the desired material in the middle left, bottom left, middle right, and bottom right squares of a crafting table."
          }
       ],
       [
          {
             "id":"stall disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"red stone wire",
             "desc":"Redstone wire is simply red stone placed on the floor."
          }
       ],
       [
          {
             "id":"piston",
             "desc":"A piston can be crafted by placing an iron ingot in the center square, red stone in the bottom middle square, wooden planks across the top row, and cobblestone in the remaining squares."
          }
       ],
       [
          {
             "id":"white stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"mine cart with furnace",
             "desc":"A mine cart with a furnace is crafted by placing a furnace on top of a mine cart in a crafting window."
          }
       ],
       [
          {
             "id":"sugar",
             "desc":"Sugar can be obtained by placing sugar cane in a crafting window."
          }
       ],
       [
          {
             "id":"chain mail chest plate",
             "desc":"Chain mail armor can only be obtained by trading with a villager or getting a rare drop off of a mob."
          }
       ],
       [
          {
             "id":"feather",
             "desc":"Feathers can be randomly obtained by killing chickens."
          }
       ],
       [
          {
             "id":"light blue stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"oak fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"stone pick ax",
             "desc":"All types of pick axes can be crafted by placing three of the desired material across the top row, and then placing sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"pink carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"monster spawner",
             "desc":"Monster spawners can not be obtained without cheats in mine craft."
          }
       ],
       [
          {
             "id":"golden carrot",
             "desc":"A golden carrot can be crafted by placing a carrot in the very middle square and eight gold nuggets surrounding that."
          }
       ],
       [
          {
             "id":"stick",
             "desc":"A stick can be crafted by placing a wooden plank on top of a wooden plank in a crafting window."
          }
       ],
       [
          {
             "id":"diamond block",
             "desc":"A diamond block can be crafted by placing diamonds in every square in a crafting table."
          }
       ],
       [
          {
             "id":"green stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"cooked chicken",
             "desc":"Raw Chicken can be cooked by smelting it in a furnace. Alternately, Cooked Chicken has a chance of dropping when a Chicken dies while on fire."
          }
       ],
       [
          {
             "id":"thirteen disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"wooden trapdoor",
             "desc":"A wooden trapdoor can be crafted by placing wooden planks in all spaces in the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"oak fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"crafting bench",
             "desc":"A crafting bench is crafted by placing wooden planks in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"nether quartz ore",
             "desc":"Nether quartz ore can be randomly found in the nether. To obtain the ore instead of nether quartz, you will need to use a silk touch pick ax."
          }
       ],
       [
          {
             "id":"golden sword",
             "desc":"All types of swords can be crafted by placing the desired material in the top middle and very center square, with a stick beneath them, in a crafting table"
          }
       ],
       [
          {
             "id":"gray stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"light blue stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"diamond boots",
             "desc":"All boots are crafted by placing the desired material in the middle left, bottom left, middle right, and bottom right squares of a crafting table."
          }
       ],
       [
          {
             "id":"stone hoe",
             "desc":"All types of hoes can be crafted by placing two of the desired material in the top left, and top middle squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"coal ore",
             "desc":"Coal ore can be obtained by breaking a coal ore block with a pick ax that is enchanted with silk touch"
          }
       ],
       [
          {
             "id":"dark oak leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"t.n.t.",
             "desc":"T.N.T can be crafted by placing gunpowder in an x shape in a crafting grid and then placing sand in all remaining squares."
          }
       ],
       [
          {
             "id":"brick",
             "desc":"A brick can be crafted by smelting clay in a furnace."
          }
       ],
       [
          {
             "id":"potato",
             "desc":"Potatoes can be rarely obtained by killing zombies or, they can be found as crops in villages."
          }
       ],
       [
          {
             "id":"orange carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"ink sack",
             "desc":"An ink sack can be obtained by killing a squid."
          }
       ],
       [
          {
             "id":"red stone",
             "desc":"Redstone can be obtained by breaking red stone ore with an iron pick ax or better."
          }
       ],
       [
          {
             "id":"dark oak wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"diorite",
             "desc":"Diorite can be mined with a pick ax or crafted by combining cobblestone and nether quartz in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"workbench",
             "desc":"A workbench is crafted by placing wooden planks in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"gray stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"jungle fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"magenta wool",
             "desc":"Magenta wool can be crafted by placing magenta dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"dirt",
             "desc":"Dirt can be obtained by breaking grass or dirt with a shovel."
          }
       ],
       [
          {
             "id":"armor stand",
             "desc":"An Armor Stand can be crafted with six sticks and one stone slab. Take three sticks and place it across the first row. Take the remaining three sticks and place one each in the bottom left, bottom right, and center middle. Place the stone slab in the bottom middle."
          }
       ],
       [
          {
             "id":"cooked fish",
             "desc":"Cooked fish is obtained by cooking fish in a furnace."
          }
       ],
       [
          {
             "id":"lever",
             "desc":"A lever can be crafted by placing a stick on top of cobblestone in a crafting window."
          }
       ],
       [
          {
             "id":"leash",
             "desc":"A leash can be crafted by placing a slime ball in the very center, and then placing string in the top left, top middle, left middle, and bottom right squares in a crafting table."
          }
       ],
       [
          {
             "id":"cooked rabbit",
             "desc":"Cooked rabbit can be obtained by cooking raw rabbit in a furnace. Alternately, Cooked Rabbit has a chance of dropping when a Rabbit dies while on fire."
          }
       ],
       [
          {
             "id":"jungle wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"mine cart with hopper",
             "desc":"A Mine cart With a Hopper can be crafted by placing a Hopper on top of a Mine cart in a crafting table."
          }
       ],
       [
          {
             "id":"fermented spider eye",
             "desc":"Fermented spider eye can be obtained by placing a brown mushroom in the middle left square, sugar in the very center square, and a spider eye in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"raw fish",
             "desc":"Raw fish is randomly obtained by fishing."
          }
       ],
       [
          {
             "id":"brown stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"sign",
             "desc":"A sign is crafted by placing wooden planks in the top two rows and a stick in the bottom middle square."
          }
       ],
       [
          {
             "id":"t.n.t",
             "desc":"T.N.T can be crafted by placing gunpowder in an x shape in a crafting grid and then placing sand in all remaining squares."
          }
       ],
       [
          {
             "id":"hopper",
             "desc":"A hopper can be crafted by placing a chest in the very center square, and then iron ingots in every square but the top middle, bottom left, and bottom right squares in a crafting grid."
          }
       ],
       [
          {
             "id":"blaze rod",
             "desc":"Blaze rods can be randomly obtained by killing blazes."
          }
       ],
       [
          {
             "id":"red stone comparator",
             "desc":"A red stone comparator can be crafted by placing three smooth stone across the bottom row, a nether quartz in the center square, and three red stone torches surrounding the nether quartz in a crafting table."
          }
       ],
       [
          {
             "id":"bone",
             "desc":"Bones can be obtained by killing skeletons."
          }
       ],
       [
          {
             "id":"golden horse armor",
             "desc":"Horse Armor can be randomly found in Dungeons, Nether fortresses, Village blacksmiths, jungle temples, desert temples, and stronghold chests."
          }
       ],
       [
          {
             "id":"golden pants",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"rail",
             "desc":"A rail can be crafted by placing a stick in the very middle square and iron ingots vertically in both the first and last column in a crafting table."
          }
       ],
       [
          {
             "id":"wheat seeds",
             "desc":"Wheat seeds are obtained by harvesting wheat."
          }
       ],
       [
          {
             "id":"birch fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"purple stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"golden chestplate",
             "desc":"All chestplates are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"leather boots",
             "desc":"All boots are crafted by placing the desired material in the middle left, bottom left, middle right, and bottom right squares of a crafting table."
          }
       ],
       [
          {
             "id":"diamond shovel",
             "desc":"All types of shovels can be crafted by placing the desired material in the top middle square, and then sticks in the two squares directly beneath that in a crafting table."
          }
       ],
       [
          {
             "id":"leather leggings",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"red sand",
             "desc":"Red sand can be found in Mesa biomes."
          }
       ],
       [
          {
             "id":"vines",
             "desc":"Vines can only be harvested with shears. Vines spawn naturally in jungle trees or in swamplands."
          }
       ],
       [
          {
             "id":"glass bottle",
             "desc":"A glass bottle is crafted by creating a V shape with three glass blocks in a crafting table."
          }
       ],
       [
          {
             "id":"red stone ore",
             "desc":"Redstone ore can be found in the bottom sixteen layers on the map. If broken with an iron pick ax or better, it will drop some amount of red stone. To obtain the ore itself, one would need to use a pick ax with a silk touch enchant."
          }
       ],
       [
          {
             "id":"emerald block",
             "desc":"Emerald blocks can be crafted by placing nine emeralds in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"granite",
             "desc":"Granite can be mined with a pick ax or crafted by placing Diorite and a nether quartz next to each other in a crafting table."
          }
       ],
       [
          {
             "id":"brown wool",
             "desc":"Brown wool can be crafted by placing brown dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"golden apple",
             "desc":"A golden apple can be crafted by placing an apple in the very center square and eight gold ingots surrounding it."
          }
       ],
       [
          {
             "id":"birch leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"white wool",
             "desc":"White wool can be crated by placing four string in a two by two grid in a crafting window. It can also be obtained by placing bone meal next to any color wool in a crafting window"
          }
       ],
       [
          {
             "id":"purple carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"hardened clay",
             "desc":"Hardened clay can be crafted by smelting a clay block in a furnace."
          }
       ],
       [
          {
             "id":"zombie mob head",
             "desc":"Mob heads can be obtained by having a charged creeper blow up the mob whose head you want to obtain."
          }
       ],
       [
          {
             "id":"iron trapdoor",
             "desc":"An iron trapdoor can be crafted by placing iron ingots in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"flower pot",
             "desc":"A flower pot is crafted by placing three bricks in a V shape in a crafting table."
          }
       ],
       [
          {
             "id":"iron ore",
             "desc":"Iron ore can be obtained by breaking iron ore blocks with a stone pick ax or better"
          }
       ],
       [
          {
             "id":"jungle wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"birch wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"jungle door",
             "desc":"A Jungle Door can be crafted by placing six Jungle Planks down the first two columns."
          }
       ],
       [
          {
             "id":"golden ax",
             "desc":"All types of axes can be crafted by placing three of the desired materials in the top left, top middle, and middle left squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"packed ice",
             "desc":"Packed ice can be found in the rare ice plains spikes biome and can only be obtained with a silk touch tool."
          }
       ],
       [
          {
             "id":"bricks",
             "desc":"Bricks can be crafted by smelting clay in a furnace."
          }
       ],
       [
          {
             "id":"light blue carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"dead shrub",
             "desc":"Dead bushes, also known as shrubs, can be obtained with shears."
          }
       ],
       [
          {
             "id":"dropper",
             "desc":"A dropper can be crafted by placing red stone in the middle bottom square, and cobblestone in every other square but the center one."
          }
       ],
       [
          {
             "id":"chest",
             "desc":"A chest is crafted by placing wooden planks, in every square but the middle square, in a crafting table."
          }
       ],
       [
          {
             "id":"raw chicken",
             "desc":"Raw Chicken will drop from the death of a Chicken."
          }
       ],
       [
          {
             "id":"raw salmon",
             "desc":"Raw salmon is randomly obtained by fishing."
          }
       ],
       [
          {
             "id":"tripwire hook",
             "desc":"A tripwire hook can be crafted by placing an iron ingot on top of a stick on top of a wood plank in a crafting table."
          }
       ],
       [
          {
             "id":"oak wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"mine cart with command block",
             "desc":"A mine cart with a command block can not be obtained without cheats."
          }
       ],
       [
          {
             "id":"eye of ender",
             "desc":"An eye of ender can be crafted by placing blaze power next to an ender pearl in a crafting window."
          }
       ],
       [
          {
             "id":"block of coal",
             "desc":"A block of coal can be crafted by placing coal in a three by three grid in a crafting window."
          }
       ],
       [
          {
             "id":"nether star",
             "desc":"A Nether Star can be obtained by defeating the Wither."
          }
       ],
       [
          {
             "id":"gravel",
             "desc":"Gravel can be obtained by breaking gravel blocks"
          }
       ],
       [
          {
             "id":"blue wool",
             "desc":"Blue wool can be crafted by placing lapis lazuli next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"nether quartz",
             "desc":"Nether Quartz can be obtained by smelting Nether Quartz Ore in a furnace."
          }
       ],
       [
          {
             "id":"rotten flesh",
             "desc":"Rotten flesh can be randomly obtained by killing zombies."
          }
       ],
       [
          {
             "id":"magenta carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"white stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"birch fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"carrots",
             "desc":"Carrots can be rarely obtained by killing zombies or, they can be naturally found as crops in villages."
          }
       ],
       [
          {
             "id":"purple dye",
             "desc":"Purple dye can be crafted by placing lapis lazuli next to rose red in a crafting window."
          }
       ],
       [
          {
             "id":"lapis lazuli block",
             "desc":"A lapis lazuli block can be obtained by entirely filling a crafting table with lapis lazuli."
          }
       ],
       [
          {
             "id":"obsidian",
             "desc":"Obsidian can be mined with a diamond pick or created by placing water on top of lava. "
          }
       ],
       [
          {
             "id":"mellohi disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music discs are found in eight percent of dungeon chests."
          }
       ],
       [
          {
             "id":"gray wool",
             "desc":"Gray wool can be crafted by placing gray dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"trapped chest",
             "desc":"A trapped chest can be crafted by placing a tripwire hook next to a chest in a crafting window."
          }
       ],
       [
          {
             "id":"light gray stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"iron pick ax",
             "desc":"All types of pick axes can be crafted by placing three of the desired material across the top row, and then placing sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"red mushroom",
             "desc":"Red mushrooms can be found naturally in darkly lit areas, mushroom biomes, or the nether."
          }
       ],
       [
          {
             "id":"puffer fish",
             "desc":"A puffer fish can be randomly obtained by fishing."
          }
       ],
       [
          {
             "id":"emerald",
             "desc":"Emeralds can be obtained by harvesting emerald ore."
          }
       ],
       [
          {
             "id":"wooden shovel",
             "desc":"All types of shovels can be crafted by placing the desired material in the top middle square, and then sticks in the two squares directly beneath that in a crafting table."
          }
       ],
       [
          {
             "id":"golden helmet",
             "desc":"All helmets are crafted by placing the desired material in all squares but the very center square and the bottom row in a crafting table"
          }
       ],
       [
          {
             "id":"melon",
             "desc":"A melon can be found naturally in jungles or can be grown from melon seeds found in chest mine carts in abandoned mine shafts."
          }
       ],
       [
          {
             "id":"clay block",
             "desc":"Clay is commonly found at the bottoms of rivers and lakes in shallow, circular patches. Clay blocks can also be found commonly in swamps."
          }
       ],
       [
          {
             "id":"anvil",
             "desc":"An anvil can be crafted by placing three blocks of iron across the top row, an iron ingot in the very center square, and then three iron ingots across the bottom row in a crafting table."
          }
       ],
       [
          {
             "id":"daylight sensor",
             "desc":"A daylight sensor can be crafted by placing three glass across the top row, three nether quartz across the middle grow, anad three wooden slabs across the bottom row in a crafting table."
          }
       ],
       [
          {
             "id":"lead",
             "desc":"A lead can be crafted by placing a slime ball in the very center, and then placing string in the top left, top middle, left middle, and bottom right squares in a crafting table."
          }
       ],
       [
          {
             "id":"sandstone",
             "desc":"Sandstone can be obtained in deserts or crafted by combining sand together in a two by two square."
          }
       ],
       [
          {
             "id":"leather tunic",
             "desc":"All chest pieces are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"black stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"lime stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"mine cart with t.n.t",
             "desc":"A Mine cart with T.N.T can be crafted by placing a T.N.T on top of a Mine cart in a crafting table."
          }
       ],
       [
          {
             "id":"clock",
             "desc":"A clock is crafted by placing red stone in the very center square and surrounding it with four gold ingots in a crafting table."
          }
       ],
       [
          {
             "id":"black carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"cocoa",
             "desc":"Cocoa beans come from cocoa pods, which are naturally found in jungle biomes. Cocoa beans are used as brown dye in minecraft."
          }
       ],
       [
          {
             "id":"gold ingot",
             "desc":"Gold ingots can be obtained by smelting gold ore in a furnace."
          }
       ],
       [
          {
             "id":"stone brick slab",
             "desc":"A stone brick slab can be crafted by placing three stone bricks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"clown fish",
             "desc":"A clown fish can be randomly obtained by fishing."
          }
       ],
       [
          {
             "id":"pumpkin seeds",
             "desc":"Pumpkin seeds can be crafted by placing a pumpkin in a crafting window."
          }
       ],
       [
          {
             "id":"mossy stone brick",
             "desc":"Mossy stone brick can be crafted by placing vines next to stone bricks in a crafting window. Mossy stone brick can also be found naturally in strongholds."
          }
       ],
       [
          {
             "id":"cobweb",
             "desc":"Cobwebs can be obtained by using shears or a sword that is enchanted with silk touch"
          }
       ],
       [
          {
             "id":"milk bucket",
             "desc":"A milk bucket can be obtained by right clicking on a cow with an iron bucket."
          }
       ],
       [
          {
             "id":"iron helmet",
             "desc":"All helmets are crafted by placing the desired material, in all squares but the very center square, and the bottom row, in a crafting table."
          }
       ],
       [
          {
             "id":"yellow stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"light gray stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"diamond",
             "desc":"Diamond can be obtained by breaking diamond ore with an iron pick ax or better."
          }
       ],
       [
          {
             "id":"stone sword",
             "desc":"All types of swords can be crafted by placing the desired material in the top middle and very center square, with a stick beneath them, in a crafting table"
          }
       ],
       [
          {
             "id":"cobblestone stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"bed",
             "desc":"A bed can be crafted by placing three wool across the top row and three wooden planks across the middle row in a crafting table."
          }
       ],
       [
          {
             "id":"birch wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"quartz slab",
             "desc":"A quartz slab can be crafted by placing three quartz blocks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"sponge",
             "desc":"Sponges can be obtained by killing an elder guardian or randomly finding them in ocean monuments"
          }
       ],
       [
          {
             "id":"skeleton mob head",
             "desc":"Mob heads can be obtained by having a charged creeper blow up the mob whose head you want to obtain."
          }
       ],
       [
          {
             "id":"bucket",
             "desc":"A bucket can be crafted by placing three iron ingots in a V shape in a crafting table."
          }
       ],
       [
          {
             "id":"diamond sword",
             "desc":"All types of swords can be crafted by placing the desired material in the top middle and very center square, with a stick beneath them, in a crafting table"
          }
       ],
       [
          {
             "id":"golden shovel",
             "desc":"All types of shovels can be crafted by placing the desired material in the top middle square, and then sticks in the two squares directly beneath that in a crafting table."
          }
       ],
       [
          {
             "id":"spruce wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"iron bars",
             "desc":"Iron bars can be crafted by placing six iron ingots across the bottom two rows in a crafting table. Iron bars can also be found naturally in strongholds."
          }
       ],
       [
          {
             "id":"raw rabbit",
             "desc":"Raw rabbit can be randomly obtained by killing a rabbit."
          }
       ],
       [
          {
             "id":"yellow carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"carrot on a stick",
             "desc":"A carrot on a stick can be crafted by placing a fishing pole in the middle left square and a carrot in the bottom middle square in a crafting window."
          }
       ],
       [
          {
             "id":"raw pork chop",
             "desc":"A raw pork chop can be obtained by killing a pig."
          }
       ],
       [
          {
             "id":"furnace",
             "desc":"A furnace can be crafted by placing cobblestone in every square but the middle square in a crafting table."
          }
       ],
       [
          {
             "id":"nether brick fence",
             "desc":"A nether brick fence can be crafted by placing six nether brick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"diamond horse armor",
             "desc":"Horse Armor can be randomly found in Dungeons, Nether fortresses, Village blacksmiths, jungle temples, desert temples, and stronghold chests."
          }
       ],
       [
          {
             "id":"red sandstone slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"birch wood plank",
             "desc":"Birch wood planks can be obtained by placing birch wood in a crafting table."
          }
       ],
       [
          {
             "id":"bedrock",
             "desc":"Bedrock can not be obtained by a player without cheats. It is the bottom most block in the game."
          }
       ],
       [
          {
             "id":"saddle",
             "desc":"Saddles can not be crafted and can only be obtained by finding them in chests inside dungeons, abandoned mine shafts, nether fortresses, desert temples, or jungle temples."
          }
       ],
       [
          {
             "id":"light gray dye",
             "desc":"Light gray dye can be crafted by placing two bone meal in a vertical row next to an ink sac in a crafting window."
          }
       ],
       [
          {
             "id":"jungle leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"blocks disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"pumpkin",
             "desc":"Pumpkins can be rarely be found on grass in most biomes."
          }
       ],
       [
          {
             "id":"baked potato",
             "desc":"A baked potato can be obtained by smelting a potato in a furnace."
          }
       ],
       [
          {
             "id":"leather",
             "desc":"Leather can be randomly obtained by killing cows or horses."
          }
       ],
       [
          {
             "id":"light gray carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"iron boots",
             "desc":"All boots are crafted by placing the desired material in the middle left, bottom left, middle right, and bottom right squares of a crafting table."
          }
       ],
       [
          {
             "id":"end stone",
             "desc":"End stone can be found naturally in the end dimension."
          }
       ],
       [
          {
             "id":"chainmail leggings",
             "desc":"Chainmail armor can only be obtained by trading with a villager or getting a rare drop off of a mob."
          }
       ],
       [
          {
             "id":"rabbit\"s foot",
             "desc":"A rabbit\"s foot can be obtained rarely by killing a rabbit."
          }
       ],
       [
          {
             "id":"glass",
             "desc":"Glass can be obtained by smelting sand in a furnace."
          }
       ],
       [
          {
             "id":"stone",
             "desc":"Stone can be made by smelting cobblestone in a furnace."
          }
       ],
       [
          {
             "id":"prismarine",
             "desc":"Prismarine can be crafted by placing prismarine shards in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"compass",
             "desc":"A compass is crafted by placing red stone in the very center square, and surrounding it with four iron ingots, in a crafting table."
          }
       ],
       [
          {
             "id":"green stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"gold leggings",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"command block",
             "desc":"Command blocks can not be obtained without cheats in minecraft."
          }
       ],
       [
          {
             "id":"dispenser",
             "desc":"A dispenser can be created by placing a bow in the very center square, red stone right beneath that, and cobblestone in every other square."
          }
       ],
       [
          {
             "id":"poisonous potato",
             "desc":"A poisonous potato will randomly be dropped when harvesting potatoes."
          }
       ],
       [
          {
             "id":"apple",
             "desc":"Apples randomly drop from oak and dark oak leaves. They can also be randomly found in chests in strongholds or villages."
          }
       ],
       [
          {
             "id":"red flower",
             "desc":"Poppies can be found naturally on grass or created randomly by using bone meal on grass."
          }
       ],
       [
          {
             "id":"magenta dye",
             "desc":"Magenta dye can be crafted by placing purple dye next to pink dye in a crafting window."
          }
       ],
       [
          {
             "id":"brown carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"prismarine shard",
             "desc":"Prismarine Shards can be obtained by defeating Guardians and Elder Guardians."
          }
       ],
       [
          {
             "id":"red stone block",
             "desc":"A red stone block can be crafted by placing nine red stone in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"yellow stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"dandelion yellow",
             "desc":"Dandelion yellow is the equivalent of yellow dye in minecraft. It can be crafted by placing a dandelion or a sunflower in a crafting window."
          }
       ],
       [
          {
             "id":"acacia wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares."
          }
       ],
       [
          {
             "id":"sandstone slab",
             "desc":"A sandstone slab can be crated by placing three sandstone blocks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"gray carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"polished granite",
             "desc":"Polished Granite can be crafted by placing four granite in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"mine cart",
             "desc":"A mine cart is crafted by placing five iron ingots in a U shape in a crafting table."
          }
       ],
       [
          {
             "id":"brown stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"cyan stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"book",
             "desc":"A book is crafted by creating a two by two grid where the bottom right square is leather and all other squares are paper in a crafting window."
          }
       ],
       [
          {
             "id":"mine cart with a chest",
             "desc":"A mine cart with a chest is crafted by placing a chest on top of a mine cart in a crafting window."
          }
       ],
       [
          {
             "id":"acacia sapling",
             "desc":"Acacia saplings can be randomly obtained by breaking acacia leaves."
          }
       ],
       [
          {
             "id":"paper",
             "desc":"Paper is crafted by placing three sugar cane, across a row, in a crafting table."
          }
       ],
       [
          {
             "id":"gold chest plate",
             "desc":"All chest plates are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"cyan stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"mushroom stew",
             "desc":"Mushroom stew is crafted by placing a red mushroom in the middle left square, a brown mushroom in the very center square, and a bowl in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"nether brick",
             "desc":"Nether Brick can be mined with a pick ax, or crafted by placing four Nether Bricks in a two by two square in a crafting table."
          }
       ],
       [
          {
             "id":"magma cream",
             "desc":"Magma cream can be crafted by placing blaze powder next to a slime ball in a crafting window."
          }
       ],
       [
          {
             "id":"snow",
             "desc":"Snow can be crafted by placing snowballs in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"orange dye",
             "desc":"Orange dye can be crafted by placing rose red next to dandelion yellow in a crafting window."
          }
       ],
       [
          {
             "id":"potion",
             "desc":"A potion is created by utilizing a brewing stand, cauldron, and water bottles."
          }
       ],
       [
          {
             "id":"lime stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"white stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"boat",
             "desc":"A boat can be obtained by making a U shape with five wooden planks."
          }
       ],
       [
          {
             "id":"dark prismarine",
             "desc":"Dark prismarine can be crafted by placing an ink sac in the very center square, and then eight placing prismarine shards around it."
          }
       ],
       [
          {
             "id":"oak door",
             "desc":"A Oak Door can be crafted by placing six Oak Planks down the first two columns."
          }
       ],
       [
          {
             "id":"cocoa beans",
             "desc":"Cocoa beans come from cocoa pods, which are naturally found in jungle biomes. Cocoa beans are used as brown dye in minecraft."
          }
       ],
       [
          {
             "id":"oak wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"red wool",
             "desc":"Red wool can be crafted by placing rose red next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"cooked mutton",
             "desc":"Cooked mutton can be obtained by cooking raw mutton in a furnace. Alternately, one to two pieces of Cooked Mutton are dropped when a sheep dies while on fire."
          }
       ],
       [
          {
             "id":"dark oak fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"iron door",
             "desc":"An Iron Door can be crafted by placing six Iron Ingots down the first two columns."
          }
       ],
       [
          {
             "id":"painting",
             "desc":"A painting is crafted by placing wool in the very center square and surrounding it with eight sticks."
          }
       ],
       [
          {
             "id":"spruce leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"pink stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"acacia wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"dark oak wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"chiseled sandstone",
             "desc":"Chiseled sandstone can be created by placing a sandstone slab on top of a sandstone slab, in a crafting window."
          }
       ],
       [
          {
             "id":"oak wood plank",
             "desc":"Oak wood planks can be obtained by placing oak wood in a crafting table."
          }
       ],
       [
          {
             "id":"cooked salmon",
             "desc":"Cooked salmon is obtained by cooking salmon in a furnace."
          }
       ],
       [
          {
             "id":"iron shovel",
             "desc":"All types of shovels can be crafted by placing the desired material in the top middle square, and then sticks in the two squares directly beneath that in a crafting table."
          }
       ],
       [
          {
             "id":"enchanting table",
             "desc":"An enchanting table can be crafted by placing a book in the top middle square, diamonds in the middle left and middle right squares, and obsidian in the very center and across the bottom row, in a crafting table."
          }
       ],
       [
          {
             "id":"red stone repeater",
             "desc":"A red stone repeater can be crafted by placing smooth stone in all three squares across the bottom row, red stone in the very middle square, and red stone torches on both sides of the red stone."
          }
       ],
       [
          {
             "id":"far disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"green carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"iron ingot",
             "desc":"Iron ingots can be obtained by smelting iron ore in a furnace."
          }
       ],
       [
          {
             "id":"orange wool",
             "desc":"Orange wool can be crafted by placing orange dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"jungle sapling",
             "desc":"Jungle saplings can be randomly obtained by breaking jungle leaves."
          }
       ],
       [
          {
             "id":"stone slab",
             "desc":"A stone slab can be crafted by placing three stone blocks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"light blue stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"cyan dye",
             "desc":"Cyan dye can be crafted by placing lapis lazuli next to cactus green in a crafting window."
          }
       ],
       [
          {
             "id":"steak",
             "desc":"Raw Beef can be cooked into Steak by smelting it in a furnace. Alternately, Steak has a chance of dropping when a Cow or Moo shroom dies while on fire."
          }
       ],
       [
          {
             "id":"orange stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"blue stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"spruce fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"coal",
             "desc":"Coal can be obtained by breaking a coal ore block with a wooden pick ax or better."
          }
       ],
       [
          {
             "id":"potatoes",
             "desc":"Potatoes can be rarely obtained by killing zombies or, they can be found as crops in villages."
          }
       ],
       [
          {
             "id":"light gray stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"egg",
             "desc":"Eggs are randomly produced by chickens. Throwing an egg has a chance to create a new chicken."
          }
       ],
       [
          {
             "id":"spruce wood plank",
             "desc":"Spruce wood planks can be obtained by placing spruce wood in a crafting table."
          }
       ],
       [
          {
             "id":"orange stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"acacia wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"light gray wool",
             "desc":"Light gray wool can be crafted by placing light gray dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"hay bale",
             "desc":"A hay bale can be crafted by placing wheat in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"clay",
             "desc":"Clay is obtained by breaking clay blocks with a non silk touch tool."
          }
       ],
       [
          {
             "id":"bowl",
             "desc":"A bowl can be crafted by placing three wooden planks in a v shape in a crafting table."
          }
       ],
       [
          {
             "id":"leather helmet",
             "desc":"All helmets are crafted by placing the desired material in all squares but the very center square and the bottom row in a crafting table"
          }
       ],
       [
          {
             "id":"pink stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"diamond chest plate",
             "desc":"All chest plates are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"gray stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"yellow stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"snowman",
             "desc":"A snow golem can be created by placing a pumpkin on top of  two snow blocks on the ground."
          }
       ],
       [
          {
             "id":"diamond ore",
             "desc":"Diamond ore can be found in the bottom sixteen layers on the map. One can break diamond ore with an iron pick ax or better. This will cause the diamond ore to break into a diamond. To obtain the ore, you will need to use a pick ax with the silk touch enchant."
          }
       ],
       [
          {
             "id":"banner",
             "desc":"A Banner can be crafted by placing six wool across the top two rows, then placing a stick on the bottom middle. The banner will take on the color of the wool you choose."
          }
       ],
       [
          {
             "id":"stone ax",
             "desc":"All types of axes can be crafted by placing three of the desired material in the top left, top middle, and middle left squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"firework star",
             "desc":"A firework star can be crafted by placing gunpower in the middle left square and any color dye in the center square in a crafting table. A firework star can also be crafted with optional ingredients such as diamonds, glow stone dust, or feathers, that are placed directly beneath the dye in a crafting table."
          }
       ],
       [
          {
             "id":"nether wart",
             "desc":"Nether warts can be naturally found in nether fortresses as a plant."
          }
       ],
       [
          {
             "id":"red stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"quartz block",
             "desc":"A quartz block can be crafted by placing four nether quartz in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"poppy",
             "desc":"Poppies can be found naturally on grass or created randomly by using bone meal on grass."
          }
       ],
       [
          {
             "id":"acacia fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"cactus",
             "desc":"Cactus can be found naturally in desert biomes. "
          }
       ],
       [
          {
             "id":"spruce door",
             "desc":"A Spruce Door can be crafted by placing six Spruce Planks down the first two columns."
          }
       ],
       [
          {
             "id":"cat disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"flint and steel",
             "desc":"Flint and steel can be crafted by placing an iron ingot to the left of flint in a crafting window."
          }
       ],
       [
          {
             "id":"gold pants",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"slime ball",
             "desc":"Slime balls are randomly dropped by killing slimes."
          }
       ],
       [
          {
             "id":"cooked porkchop",
             "desc":"A cooked porkchop can be obtained by cooking a raw porkchop in a furnace or by lighting a pig on fire."
          }
       ],
       [
          {
             "id":"polished andesite",
             "desc":"Polished Andesite can be crafted by placing four andesite in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"prismarine bricks",
             "desc":"Prismarine bricks can be crafted by placing prismarine shards in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"wither",
             "desc":"A wither can be created by placing three wither skulls on top of soul sand that is placed on the ground in a T shape."
          }
       ],
       [
          {
             "id":"lime dye",
             "desc":"Lime dye can be crafted by placing cactus green next to bone meal in a crafting window."
          }
       ],
       [
          {
             "id":"blue carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"door",
             "desc":"A door can be crafted by placing six Planks, down the first two columns, in a crafting table."
          }
       ],
       [
          {
             "id":"tripwire",
             "desc":"Tripwire is simply string next to a tripwire hook."
          }
       ],
       [
          {
             "id":"enchantment table",
             "desc":"An enchantment table can be crafted by placing a book in the top middle square, diamonds in the middle left and middle right squares, and obsidian in the very center and across the bottom row, in a crafting table."
          }
       ],
       [
          {
             "id":"cyan carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"polished diorite",
             "desc":"Polished Diorite can be crafted by placing four diorite in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"golden boots",
             "desc":"All boots are crafted by placing the desired material in the middle left, bottom left, middle right, and bottom right squares of a crafting table."
          }
       ],
       [
          {
             "id":"iron block",
             "desc":"An iron block can be crafted by placing iron ingots in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"acacia leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"dark oak sapling",
             "desc":"Dark oak saplings can be randomly obtained by breaking dark oak leaves"
          }
       ],
       [
          {
             "id":"diamond hoe",
             "desc":"All types of hoes can be crafted by placing two of the desired material in the top left, and top middle squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"dandelion",
             "desc":"Dandelions can be found naturally on grass or created randomly by using bone meal on grass."
          }
       ],
       [
          {
             "id":"lapis lazuli",
             "desc":"Can be obtained by breaking lapis lazuli ore with a stone pick ax or better"
          }
       ],
       [
          {
             "id":"sugar cane",
             "desc":"Sugar cane can be found naturally near water,"
          }
       ],
       [
          {
             "id":"birch door",
             "desc":"A Birch Door can be crafted by placing six Birch Planks down the first two columns."
          }
       ],
       [
          {
             "id":"cactus green",
             "desc":"Cactus green can be crafted by smelting a cactus in a furnace."
          }
       ],
       [
          {
             "id":"gold block",
             "desc":"A gold block can be crafted by placing gold ingots in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"smooth sandstone",
             "desc":"Smooth sandstone can be created by placing sandstone in a two by two grid in a crafting window"
          }
       ],
       [
          {
             "id":"magenta stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"note block",
             "desc":"A note block is crafted by placing red stone in the very center square and wooden planks all around that in a crafting table"
          }
       ],
       [
          {
             "id":"snow block",
             "desc":"Snow can be crafted by placing snowballs in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"mob head",
             "desc":"Mob heads can be obtained by having a charged creeper blow up the mob whose head you want to obtain."
          }
       ],
       [
          {
             "id":"diamond leggings",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"red sandstone",
             "desc":"Red sandstone can be crafted by placing four red sand in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"orange stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"slime block",
             "desc":"A slime block can be crafted by placing slime balls in a three by three grid in a crafting window."
          }
       ],
       [
          {
             "id":"bookshelf",
             "desc":"A bookshelf is crafted by placing books across the middle row and wooden planks across the top and bottom rows"
          }
       ],
       [
          {
             "id":"cake",
             "desc":"Cake can be crafted by placing three buckets of milk across the top row, sugar in the left middle, and right middle squares, an egg in the very center square, and three wheat across the bottom squares in a crafting table."
          }
       ],
       [
          {
             "id":"wooden button",
             "desc":"A wooden button can be crafted by placing a single wooden plank in a crafting window."
          }
       ],
       [
          {
             "id":"chiseled quartz block",
             "desc":"A chiseled quartz block can be obtained by placing a quartz slab on top of a quartz slab in a crafting table."
          }
       ],
       [
          {
             "id":"stone button",
             "desc":"A stone button can be crafted by placing a single piece of smooth stone in a crafting window."
          }
       ],
       [
          {
             "id":"glow stone dust",
             "desc":"Glow stone dust is obtained by breaking glow stone blocks."
          }
       ],
       [
          {
             "id":"lime stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"cobblestone wall",
             "desc":"A cobblestone wall is crafted by placing six cobblestone across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"name tag",
             "desc":"Name Tags can only be obtained in three ways. The first way is by finding it in a Dungeon chest. The second way is by fishing. The last way Name Tags can be obtained is by trading with the Librarian Villagers for twenty to twenty two Emeralds."
          }
       ],
       [
          {
             "id":"gunpowder",
             "desc":"Gunpowder can be randomly obtained by killing creepers."
          }
       ],
       [
          {
             "id":"blaze powder",
             "desc":"Blaze powder can be obtained by placing a blaze row in a crafting window."
          }
       ],
       [
          {
             "id":"brewing stand",
             "desc":"A brewing stand can be crafted by placing a blaze rod in the center square, and three cobblestone across the bottom row in a crafting table."
          }
       ],
       [
          {
             "id":"torch",
             "desc":"A torch can be crafted by placing a piece of coal on top of a stick."
          }
       ],
       [
          {
             "id":"yellow wool",
             "desc":"Yellow wool can be crafted by placing dandelion yellow next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"watermelon",
             "desc":"A melon can be found naturally in jungles or can be grown from melon seeds found in chest minecarts in abandoned mine shafts."
          }
       ],
       [
          {
             "id":"wait disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"glistering melon",
             "desc":"A glistering melon can be crafted by placing a melon in the very center square and surrounding it with eight gold nuggets in a crafting table."
          }
       ],
       [
          {
             "id":"netherrack",
             "desc":"Netherrack can be found commonly throughout the Nether dimension."
          }
       ],
       [
          {
             "id":"leather chest plate",
             "desc":"All chest places are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"wooden slab",
             "desc":"A wooden slab can be crafted by placing three wooden planks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"nether brick stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"ice",
             "desc":"Ice can be found naturally in snow biomes. If broken, or placed near a heat source, ice will turn into water. To obtain an ice block, one would need to mine it with a silk touch pick ax."
          }
       ],
       [
          {
             "id":"large fern",
             "desc":"Large ferns are naturally found in jungle, taiga, and mega taiga biomes."
          }
       ],
       [
          {
             "id":"nether brick slab",
             "desc":"A nether brick slab can be crafted by placing three nether brick in a row in a crafting table."
          }
       ],
       [
          {
             "id":"spruce wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"iron hoe",
             "desc":"All types of hoes can be crafted by placing two of the desired material in the top left, and top middle squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"fern",
             "desc":"Ferns are naturally found in jungle, taiga, and mega taiga biomes."
          }
       ],
       [
          {
             "id":"sea lantern",
             "desc":"A sea lantern can be crafted by placing prismarine shards in the four corners of a crafting table, and then placing prismarine crystals in every other square."
          }
       ],
       [
          {
             "id":"cookie",
             "desc":"A cookie can be crafted by placing wheat, horizontally, on both sides of cocoa beans in a crafting table."
          }
       ],
       [
          {
             "id":"melon seeds",
             "desc":"Melon seeds can be crafted by placing a slice of melon in a crafting window."
          }
       ],
       [
          {
             "id":"gold nugget",
             "desc":"A gold nugget can be crafted by placing a single gold ingot into a crafting window. They can also be randomly obtained by killing a zombie pig men."
          }
       ],
       [
          {
             "id":"red stone ore block",
             "desc":"Redstone ore can be found in the bottom sixteen layers on the map. If broken with an iron pick ax or better, it will drop some amount of red stone. To obtain the ore itself, one would need to use a pick ax with a silk touch enchant."
          }
       ],
       [
          {
             "id":"diamond helmet",
             "desc":"All helmets are crafted by placing the desired material in all squares but the very center square and the bottom row in a crafting table."
          }
       ],
       [
          {
             "id":"spruce fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"golden hoe",
             "desc":"All types of hoes can be crafted by placing two of the desired material in the top left, and top middle squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"acacia wood plank",
             "desc":"Acacia wood planks can be obtained by placing acacia wood in a crafting table"
          }
       ],
       [
          {
             "id":"diamond pick ax",
             "desc":"All types of pick axes can be crafted by placing three of the desired material across the top row, and then placing sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"lapis lazuli ore",
             "desc":"Lapis Lazuli Ore can be only be obtained by using a pick ax with the silk touch enchant."
          }
       ],
       [
          {
             "id":"raw mutton",
             "desc":"Raw mutton can be obtained by killing a sheep."
          }
       ],
       [
          {
             "id":"quartz stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"brick block",
             "desc":"A brick block can be crafted by placing clay bricks in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"cobblestone slab",
             "desc":"A cobblestone slab can be crafted by placing three cobblestone blocks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"emerald ore",
             "desc":"Emerald ore can only be found in extreme hills biomes between layers four and thirty-two. It can be mined with an iron pick ax or better to obtain an emerald. To obtain the ore itself, you will need a silk touch pick ax."
          }
       ],
       [
          {
             "id":"yellow flower",
             "desc":"Dandelions can be found naturally on grass or created randomly by using bone meal on grass."
          }
       ],
       [
          {
             "id":"jack o\"lantern",
             "desc":"A jack o\"lantern can be crafted by placing a pumpkin on top of a torch in a crafting table."
          }
       ],
       [
          {
             "id":"red stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"iron leggings",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"pink stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"black dye",
             "desc":"An ink sack is used as black dye in mine craft."
          }
       ],
       [
          {
             "id":"wooden hoe",
             "desc":"All types of hoes can be crafted by placing two of the desired material in the top left, and top middle squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"purple stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"mine cart with chest",
             "desc":"A mine cart with a chest is crafted by placing a chest on top of a mine cart in a crafting window."
          }
       ],
       [
          {
             "id":"detector rail",
             "desc":"A detector rail can be crafted by placing a stone pressure plate in the very center square, red stone in the bottom middle square, and iron ingots in the far left and far right columns"
          }
       ],
       [
          {
             "id":"cyan wool",
             "desc":"Cyan wool can be crafted by placing cyan dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"iron chestplate",
             "desc":"All chestplates are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"cobblestone",
             "desc":"Cobblestone can be obtained by breaking stone with a pick ax."
          }
       ],
       [
          {
             "id":"dark oak wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares."
          }
       ],
       [
          {
             "id":"creeper mob head",
             "desc":"Mob heads can be obtained by having a charged creeper blow up the mob whose head you want to obtain."
          }
       ],
       [
          {
             "id":"carrot",
             "desc":"Carrots can be rarely obtained by killing zombies or, they can be naturally found as crops in villages."
          }
       ],
       [
          {
             "id":"rabbit hide",
             "desc":"Rabbit hide can be randomly obtained by killing a rabbit."
          }
       ],
       [
          {
             "id":"grass",
             "desc":"When harvested with a regular shovel, grass turns into dirt. In order to obtain a grass block you will need to have a shovel with the silk touch enchant."
          }
       ],
       [
          {
             "id":"strad disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"birch sapling",
             "desc":"Birch saplings can be randomly obtained by breaking birch leaves."
          }
       ],
       [
          {
             "id":"mossy stone",
             "desc":"Mossy stone can be crafted by placing vines next to cobblestone in a crafting table. It can also be found naturally in various dungeons."
          }
       ],
       [
          {
             "id":"pink dye",
             "desc":"Pink dye can be crafted by placing bone meal next to rose red in a crafting window."
          }
       ],
       [
          {
             "id":"red stone torch",
             "desc":"A red stone torch is crafted by placing red stone on top of a torch in a crafting window."
          }
       ],
       [
          {
             "id":"green stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"tall grass",
             "desc":"Tall grass, which is called grass in a players inventory, spawns on grass blacks in certain biomes. Bonemeal can be used on a grass block to grow tall grass and occasionally flowers."
          }
       ],
       [
          {
             "id":"black wool",
             "desc":"Black wool can be crafted by placing an ink sac next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"wheat crops",
             "desc":"Wheat can be found naturally in villages or can be grown from seeds that one can obtain by breaking tall grass."
          }
       ],
       [
          {
             "id":"ender pearl",
             "desc":"Ender pearls can be randomly obtained by killing ender men."
          }
       ],
       [
          {
             "id":"moss stone",
             "desc":"Moss stone can be crafted by placing vines next to cobblestone in a crafting table. It can also be found naturally in various dungeons."
          }
       ],
       [
          {
             "id":"fishing rod",
             "desc":"A fishing rod is crafted by placing three sticks in a diagonal line, and then two string beneath the top right stick in a crafting window."
          }
       ],
       [
          {
             "id":"bone meal",
             "desc":"Bone meal can be crafted by placing a bone into a crafting window."
          }
       ],
       [
          {
             "id":"quartz",
             "desc":"Nether Quartz can be obtained by smelting Nether Quartz Ore in a furnace."
          }
       ],
       [
          {
             "id":"dark oak wood plank",
             "desc":"Dark oak wood planks can be obtained by placing dark oak wood in a crafting table."
          }
       ],
       [
          {
             "id":"powered rail",
             "desc":"A powered rail can be crafted by placing a stick in the very center square, red stone in the bottom middle square, and gold ingots in the far left and far right columns"
          }
       ],
       [
          {
             "id":"beacon",
             "desc":"A beacon can be obtained by placing a nether star in the very center square, three obsidian across the bottom row, and five glass in the remaining squares in a crafting table."
          }
       ],
       [
          {
             "id":"blue stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"dark oak door",
             "desc":"A Dark Oak Door can be crafted by placing six Dark Oak Planks down the first two columns."
          }
       ],
       [
          {
             "id":"iron golem",
             "desc":"An iron golem can be created by similarly to a snow golem. Place a pumpkin head on top of two iron blocks. Then place two more iron blocks on either side of the very center iron block."
          }
       ],
       [
          {
             "id":"spruce wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"pink wool",
             "desc":"Pink wool can be crafted by placing pink dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"fire charge",
             "desc":"A fire charge can be crafted by placing blaze powder in the middle left square, coal in the very center square, and gunpowder in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"acacia door",
             "desc":"An Acacia Door can be crafted by placing six Acacia Planks down the first two columns."
          }
       ],
       [
          {
             "id":"iron pants",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"chirp disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"oak leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"arrow",
             "desc":"An arrow can be crafted by placing flint in the top middle square, a stick in the very center square, and a feather in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"wooden ax",
             "desc":"All types of axes can be crafted by placing three of the desired material in the top left, top middle, and middle left squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"glass pane",
             "desc":"A glass pane can be crafted by placing six glass blocks across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"gold helmet",
             "desc":"All helmets are crafted by placing the desired material in all squares but the very center square and the bottom row in a crafting table."
          }
       ],
       [
          {
             "id":"ender chest",
             "desc":"An ender chest can be crafted by placing an eye of ender in the center square, and then surrounding that with eight obsidian blocks in a crafting table."
          }
       ],
       [
          {
             "id":"light blue wool",
             "desc":"Light blue wool can be crafted by placing light blue dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"string",
             "desc":"String can be randomly obtained by killing spiders or by breaking cobwebs."
          }
       ],
       [
          {
             "id":"red sandstone stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"purple wool",
             "desc":"Purple wool can be crafted by placing purple dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"cyan stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"black stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"enchanted book",
             "desc":"Enchanted books can be found in chests located in dungeons, strongholds, desert temples, jungle temples, and mine shafts."
          }
       ],
       [
          {
             "id":"button",
             "desc":"A button can be crafted by placing either a single piece of smooth stone or a single wooden plank in a crafting window."
          }
       ],
       [
          {
             "id":"lime wool",
             "desc":"Lime wool can be crafted by placing lime dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"coarse dirt",
             "desc":"Coarse dirt can be obtained by breaking dirt in the Mega Taiga, Mesa, or Savanna biomes."
          }
       ],
       [
          {
             "id":"ghast tear",
             "desc":"Ghast tears can be rarely obtained by killing ghasts."
          }
       ],
       [
          {
             "id":"mine cart with a furnace",
             "desc":"A mine cart with a furnace is crafted by placing a furnace on top of a mine cart in a crafting window."
          }
       ],
       [
          {
             "id":"wheat",
             "desc":"Wheat can be found naturally in villages or can be grown from seeds that one can obtain by breaking tall grass."
          }
       ],
       [
          {
             "id":"soul sand",
             "desc":"Soul sand can be found commonly throughout the Nether dimension."
          }
       ],
       [
          {
             "id":"brown mushroom",
             "desc":"Brown mushrooms can be found naturally in darkly lit areas, mushroom biomes, or the nether."
          }
       ],
       [
          {
             "id":"chainmail helmet",
             "desc":"Chainmail armor can only be obtained by trading with a villager or getting a rare drop off of a mob."
          }
       ],
       [
          {
             "id":"written book",
             "desc":"A written book is created after a book and quill is signed."
          }
       ],
       [
          {
             "id":"spruce sapling",
             "desc":"Spruce saplings can be randomly obtained by breaking spruce leaves."
          }
       ],
       [
          {
             "id":"oak sapling",
             "desc":"Oak saplings can be randomly obtained by breaking oak leaves."
          }
       ],
       [
          {
             "id":"inverted daylight sensor",
             "desc":"An inverted daylight sensor can be created by right clicking on a daylight sensor."
          }
       ],
       [
          {
             "id":"sandstone stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"red stone lamp",
             "desc":"A red stone lamp can be crafted by placing glow stone in the very center square, and surrounding it with four red stone in a crafting table."
          }
       ],
       [
          {
             "id":"crafting table",
             "desc":"A crafting table is crafted by placing wooden planks in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"glow stone",
             "desc":"Glow stone can be found on the ceiling in the Nether dimension."
          }
       ],
       [
          {
             "id":"wooden pressure plate",
             "desc":"A wooden pressure plate can be created by placing two wooden planks, horizontally, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"charcoal",
             "desc":"Charcoal can be obtained by burning wood blocks in a furnace."
          }
       ],
       [
          {
             "id":"chainmail boots",
             "desc":"Chainmail armor can only be obtained by trading with a villager or getting a rare drop off of a mob."
          }
       ],
       [
          {
             "id":"ladder",
             "desc":"A ladder is crafted by placing sticks in every square but the top middle and bottom middle square."
          }
       ],
       [
          {
             "id":"mossy cobblestone",
             "desc":"Mossy cobblestone can be crafted by placing vines next to cobblestone in a crafting table. It can also be found naturally in various dungeons."
          }
       ],
       [
          {
             "id":"golden pick ax",
             "desc":"All types of pick axes can be crafted by placing three of the desired material across the top row, and then placing sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"seeds",
             "desc":"Wheat seeds can be randomly found by breaking tall grass."
          }
       ],
       [
          {
             "id":"acacia fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"birch wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"ward disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"music disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"enchanted golden apple",
             "desc":"An enchanted golden apple is crafted by placing an apple in the very center square and surrounding it with eight gold blocks."
          }
       ],
       [
          {
             "id":"white carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"iron sword",
             "desc":"All types of swords can be crafted by placing the desired material in the top middle and very center square, with a stick beneath them, in a crafting table"
          }
       ],
       [
          {
             "id":"diamonds pants",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"chiseled red sandstone",
             "desc":"Chiseled red sandstone can be crafted by placing a red sandstone slab on top of a red sandstone slab in a crafting window."
          }
       ],
       [
          {
             "id":"stone brick stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"pressure plate",
             "desc":"A pressure plate can be created by placing either two smooth stone or two wooden planks next to each other, horizontally, in a crafting window."
          }
       ],
       [
          {
             "id":"jungle wood plank",
             "desc":"Jungle wood planks can be obtained by placing jungle wood in a crafting table"
          }
       ],
       [
          {
             "id":"green wool",
             "desc":"Green wool can be crafted by placing cactus green next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"sugar canes",
             "desc":"Sugar canes occur naturally near water."
          }
       ],
       [
          {
             "id":"bow",
             "desc":"A bow can be crafted by placing three string in the rightmost column and then placing tree sticks in a less than sign pattern next to the string in a crafting table."
          }
       ],
       [
          {
             "id":"lime carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"flint",
             "desc":"Flint is randomly dropped while breaking gravel."
          }
       ],
       [
          {
             "id":"black stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ]
    ],
    "ITEMS":[
       [
          {
             "id":"snow golem",
             "desc":"A snow golem can be created by placing a pumpkin on top of  two snow blocks on the ground."
          }
       ],
       [
          {
             "id":"pillar quartz block",
             "desc":"A pillar of quartz can be obtained by placing a block of quartz on top of a block of quartz in mine craft."
          }
       ],
       [
          {
             "id":"firework rocket",
             "desc":"A firework rocket can be crafted by placing a firework star in the left middle square, a piece of paper in the center square, and gunpowder in the right middle square in a crafting table. Similar to a firework star, a firework rocket can have more gunpowder added in the bottom row to increase the duration of a rocket."
          }
       ],
       [
          {
             "id":"rabbit stew",
             "desc":"Rabbit stew can be crafted by plagit ing cooked rabbit in the top middle square, a carrot in the middle left square, a baked potato in the center square, any type of mushroom in the middle right square, and a bowl in the bottom middle square."
          }
       ],
       [
          {
             "id":"cauldron",
             "desc":"A cauldron can be created by placing iron ingots in all squares but the top middle and very center squares in a crafting table."
          }
       ],
       [
          {
             "id":"stone shovel",
             "desc":"All types of shovels can be crafted by placing the desired material in the top middle square, and then sticks in the two squares directly beneath that in a crafting table."
          }
       ],
       [
          {
             "id":"red carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"book and quill",
             "desc":"A book and quill can be crafted by placing a book in the middle left square, an ink sac in the very center square, and a feather in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"item frame",
             "desc":"An item frame can be crafted by placing leather in the very center square, and eight sticks surrounding it."
          }
       ],
       [
          {
             "id":"map",
             "desc":"A map can be crafted by placing a compass in the middle square and eight pieces of paper surrounding it."
          }
       ],
       [
          {
             "id":"sticky piston",
             "desc":"A sticky piston can be crafted by placing a slime ball on top of a piston in a crafting window"
          }
       ],
       [
          {
             "id":"bread",
             "desc":"Bread can be crafted by placing three wheat across a row in a crafting table."
          }
       ],
       [
          {
             "id":"wooden pick ax",
             "desc":"All types of pick axs can be crafted by placing three of the desired material across the top row, and then placing sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"shears",
             "desc":"Shears can be crafted by placing two Iron Ingots diagonal from each other."
          }
       ],
       [
          {
             "id":"raw beef",
             "desc":"Raw Beef will drop from the death of a Cow or Moo shrooms."
          }
       ],
       [
          {
             "id":"smooth red sandstone",
             "desc":"Smooth red sandstone can be crafted by placing four red sandstone in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"prismarine crystals",
             "desc":"Prismarine Crystals can be obtained by defeating Guardians and Elder Guardians."
          }
       ],
       [
          {
             "id":"oak wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"wooden sword",
             "desc":"All types of swords can be crafted by placing the desired material in the top middle and very center square, with a stick beneath them, in a crafting table"
          }
       ],
       [
          {
             "id":"stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"jungle fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"activator rail",
             "desc":"An activator rail can be crafted by placing a red stone torch in the very center square, sticks above and beneath it, and then six iron ingots in the remaining squares in a crafting table."
          }
       ],
       [
          {
             "id":"farmland",
             "desc":"Farmland can be created by plowing the land with a hoe."
          }
       ],
       [
          {
             "id":"gold ore",
             "desc":"Gold ore can be obtained by breaking gold ore blocks with an iron pick ax or better"
          }
       ],
       [
          {
             "id":"andesite",
             "desc":"Andesite can be mined with a pick ax or crafted by placing diorite next to cobblestone in a crafting table."
          }
       ],
       [
          {
             "id":"rose red",
             "desc":"Rose red can be crafted by placing a poppy into a crafting table."
          }
       ],
       [
          {
             "id":"iron axe",
             "desc":"All types of axes can be crafted by placing three of the desired material in the top left, top middle, and middle left squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"light blue dye",
             "desc":"Light blue dye can be crafted by placing lapis lazuli next to bone meal in a crafting window."
          }
       ],
       [
          {
             "id":"gray dye",
             "desc":"Gray dye can be crafted by placing bonemeal next to an ink sac in a crafting window"
          }
       ],
       [
          {
             "id":"blue stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"iron horse armor",
             "desc":"Horse Armor can be randomly found in Dungeons, Nether fortresses, Village blacksmiths, jungle temples, desert temples, and stronghold chests."
          }
       ],
       [
          {
             "id":"red stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"brick stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"golden leggings",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"dark oak fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"wither mob head",
             "desc":"Mob heads can be obtained by having a charged creeper blow up the mob whose head you want to obtain."
          }
       ],
       [
          {
             "id":"spider eye",
             "desc":"A spider eye is randomly dropped by killing spiders or witches."
          }
       ],
       [
          {
             "id":"magenta stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"brown stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"pumpkin pie",
             "desc":"A pumpkin pie can be crafted by placing a pumpkin in the left middle square, sugar in the very center square, and an egg in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"snowball",
             "desc":"A snowball can be obtained by breaking snow with a shovel."
          }
       ],
       [
          {
             "id":"juke box",
             "desc":"A juke box is crafted by placing a diamond in the very center square and wood planks all around that in a crafting table"
          }
       ],
       [
          {
             "id":"sand",
             "desc":"Sand can be obtained by breaking sand blocks."
          }
       ],
       [
          {
             "id":"dead bush",
             "desc":"Dead bushes, also known as shrubs, can be obtained with shears."
          }
       ],
       [
          {
             "id":"brick slab",
             "desc":"A brick slab can be crafted by placing three brick blocks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"lily pad",
             "desc":"Lily pads can be found naturally on water in swamplands or underground lakes."
          }
       ],
       [
          {
             "id":"leather pants",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"mossy cobblestone wall",
             "desc":"A mossy cobblestone wall is crafted by placing six mossy cobblestone across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"eleven disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chests."
          }
       ],
       [
          {
             "id":"purple stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"magenta stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"mall disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chests."
          }
       ],
       [
          {
             "id":"jungle wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"diamond ax",
             "desc":"All types of axes can be crafted by placing three of the desired material in the top left, top middle, and middle left squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"empty map",
             "desc":"A map can be crafted by placing a compass in the middle square and eight pieces of paper surrounding it."
          }
       ],
       [
          {
             "id":"stone pressure plate",
             "desc":"A stone pressure plate can be crafted by placing two smooth stone, next to each other, horizontally, in a crafting window."
          }
       ],
       [
          {
             "id":"trapdoor",
             "desc":"Trapdoors can be crafted with either wooden planks or iron ingots. To craft a wooden trapdoor, place wooden planks in all spaces in the bottom two rows. To craft an iron trapdoor, place iron ingots in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"gold boots",
             "desc":"All boots are crafted by placing the desired material in the middle left, bottom left, middle right, and bottom right squares of a crafting table."
          }
       ],
       [
          {
             "id":"stall disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"red stone wire",
             "desc":"Redstone wire is simply red stone placed on the floor."
          }
       ],
       [
          {
             "id":"piston",
             "desc":"A piston can be crafted by placing an iron ingot in the center square, red stone in the bottom middle square, wooden planks across the top row, and cobblestone in the remaining squares."
          }
       ],
       [
          {
             "id":"white stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"mine cart with furnace",
             "desc":"A mine cart with a furnace is crafted by placing a furnace on top of a mine cart in a crafting window."
          }
       ],
       [
          {
             "id":"sugar",
             "desc":"Sugar can be obtained by placing sugar cane in a crafting window."
          }
       ],
       [
          {
             "id":"chain mail chest plate",
             "desc":"Chain mail armor can only be obtained by trading with a villager or getting a rare drop off of a mob."
          }
       ],
       [
          {
             "id":"feather",
             "desc":"Feathers can be randomly obtained by killing chickens."
          }
       ],
       [
          {
             "id":"light blue stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"oak fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"stone pick ax",
             "desc":"All types of pick axes can be crafted by placing three of the desired material across the top row, and then placing sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"pink carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"monster spawner",
             "desc":"Monster spawners can not be obtained without cheats in mine craft."
          }
       ],
       [
          {
             "id":"golden carrot",
             "desc":"A golden carrot can be crafted by placing a carrot in the very middle square and eight gold nuggets surrounding that."
          }
       ],
       [
          {
             "id":"stick",
             "desc":"A stick can be crafted by placing a wooden plank on top of a wooden plank in a crafting window."
          }
       ],
       [
          {
             "id":"diamond block",
             "desc":"A diamond block can be crafted by placing diamonds in every square in a crafting table."
          }
       ],
       [
          {
             "id":"green stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"cooked chicken",
             "desc":"Raw Chicken can be cooked by smelting it in a furnace. Alternately, Cooked Chicken has a chance of dropping when a Chicken dies while on fire."
          }
       ],
       [
          {
             "id":"thirteen disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"wooden trapdoor",
             "desc":"A wooden trapdoor can be crafted by placing wooden planks in all spaces in the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"oak fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"crafting bench",
             "desc":"A crafting bench is crafted by placing wooden planks in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"nether quartz ore",
             "desc":"Nether quartz ore can be randomly found in the nether. To obtain the ore instead of nether quartz, you will need to use a silk touch pick ax."
          }
       ],
       [
          {
             "id":"golden sword",
             "desc":"All types of swords can be crafted by placing the desired material in the top middle and very center square, with a stick beneath them, in a crafting table"
          }
       ],
       [
          {
             "id":"gray stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"light blue stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"diamond boots",
             "desc":"All boots are crafted by placing the desired material in the middle left, bottom left, middle right, and bottom right squares of a crafting table."
          }
       ],
       [
          {
             "id":"stone hoe",
             "desc":"All types of hoes can be crafted by placing two of the desired material in the top left, and top middle squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"coal ore",
             "desc":"Coal ore can be obtained by breaking a coal ore block with a pick ax that is enchanted with silk touch"
          }
       ],
       [
          {
             "id":"dark oak leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"t.n.t.",
             "desc":"T.N.T can be crafted by placing gunpowder in an x shape in a crafting grid and then placing sand in all remaining squares."
          }
       ],
       [
          {
             "id":"brick",
             "desc":"A brick can be crafted by smelting clay in a furnace."
          }
       ],
       [
          {
             "id":"potato",
             "desc":"Potatoes can be rarely obtained by killing zombies or, they can be found as crops in villages."
          }
       ],
       [
          {
             "id":"orange carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"ink sack",
             "desc":"An ink sack can be obtained by killing a squid."
          }
       ],
       [
          {
             "id":"red stone",
             "desc":"Redstone can be obtained by breaking red stone ore with an iron pick ax or better."
          }
       ],
       [
          {
             "id":"dark oak wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"diorite",
             "desc":"Diorite can be mined with a pick ax or crafted by combining cobblestone and nether quartz in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"workbench",
             "desc":"A workbench is crafted by placing wooden planks in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"gray stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"jungle fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"magenta wool",
             "desc":"Magenta wool can be crafted by placing magenta dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"dirt",
             "desc":"Dirt can be obtained by breaking grass or dirt with a shovel."
          }
       ],
       [
          {
             "id":"armor stand",
             "desc":"An Armor Stand can be crafted with six sticks and one stone slab. Take three sticks and place it across the first row. Take the remaining three sticks and place one each in the bottom left, bottom right, and center middle. Place the stone slab in the bottom middle."
          }
       ],
       [
          {
             "id":"cooked fish",
             "desc":"Cooked fish is obtained by cooking fish in a furnace."
          }
       ],
       [
          {
             "id":"lever",
             "desc":"A lever can be crafted by placing a stick on top of cobblestone in a crafting window."
          }
       ],
       [
          {
             "id":"leash",
             "desc":"A leash can be crafted by placing a slime ball in the very center, and then placing string in the top left, top middle, left middle, and bottom right squares in a crafting table."
          }
       ],
       [
          {
             "id":"cooked rabbit",
             "desc":"Cooked rabbit can be obtained by cooking raw rabbit in a furnace. Alternately, Cooked Rabbit has a chance of dropping when a Rabbit dies while on fire."
          }
       ],
       [
          {
             "id":"jungle wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"mine cart with hopper",
             "desc":"A Mine cart With a Hopper can be crafted by placing a Hopper on top of a Mine cart in a crafting table."
          }
       ],
       [
          {
             "id":"fermented spider eye",
             "desc":"Fermented spider eye can be obtained by placing a brown mushroom in the middle left square, sugar in the very center square, and a spider eye in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"raw fish",
             "desc":"Raw fish is randomly obtained by fishing."
          }
       ],
       [
          {
             "id":"brown stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"sign",
             "desc":"A sign is crafted by placing wooden planks in the top two rows and a stick in the bottom middle square."
          }
       ],
       [
          {
             "id":"t.n.t",
             "desc":"T.N.T can be crafted by placing gunpowder in an x shape in a crafting grid and then placing sand in all remaining squares."
          }
       ],
       [
          {
             "id":"hopper",
             "desc":"A hopper can be crafted by placing a chest in the very center square, and then iron ingots in every square but the top middle, bottom left, and bottom right squares in a crafting grid."
          }
       ],
       [
          {
             "id":"blaze rod",
             "desc":"Blaze rods can be randomly obtained by killing blazes."
          }
       ],
       [
          {
             "id":"red stone comparator",
             "desc":"A red stone comparator can be crafted by placing three smooth stone across the bottom row, a nether quartz in the center square, and three red stone torches surrounding the nether quartz in a crafting table."
          }
       ],
       [
          {
             "id":"bone",
             "desc":"Bones can be obtained by killing skeletons."
          }
       ],
       [
          {
             "id":"golden horse armor",
             "desc":"Horse Armor can be randomly found in Dungeons, Nether fortresses, Village blacksmiths, jungle temples, desert temples, and stronghold chests."
          }
       ],
       [
          {
             "id":"golden pants",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"rail",
             "desc":"A rail can be crafted by placing a stick in the very middle square and iron ingots vertically in both the first and last column in a crafting table."
          }
       ],
       [
          {
             "id":"wheat seeds",
             "desc":"Wheat seeds are obtained by harvesting wheat."
          }
       ],
       [
          {
             "id":"birch fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"purple stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"golden chestplate",
             "desc":"All chestplates are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"leather boots",
             "desc":"All boots are crafted by placing the desired material in the middle left, bottom left, middle right, and bottom right squares of a crafting table."
          }
       ],
       [
          {
             "id":"diamond shovel",
             "desc":"All types of shovels can be crafted by placing the desired material in the top middle square, and then sticks in the two squares directly beneath that in a crafting table."
          }
       ],
       [
          {
             "id":"leather leggings",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"red sand",
             "desc":"Red sand can be found in Mesa biomes."
          }
       ],
       [
          {
             "id":"vines",
             "desc":"Vines can only be harvested with shears. Vines spawn naturally in jungle trees or in swamplands."
          }
       ],
       [
          {
             "id":"glass bottle",
             "desc":"A glass bottle is crafted by creating a V shape with three glass blocks in a crafting table."
          }
       ],
       [
          {
             "id":"red stone ore",
             "desc":"Redstone ore can be found in the bottom sixteen layers on the map. If broken with an iron pick ax or better, it will drop some amount of red stone. To obtain the ore itself, one would need to use a pick ax with a silk touch enchant."
          }
       ],
       [
          {
             "id":"emerald block",
             "desc":"Emerald blocks can be crafted by placing nine emeralds in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"granite",
             "desc":"Granite can be mined with a pick ax or crafted by placing Diorite and a nether quartz next to each other in a crafting table."
          }
       ],
       [
          {
             "id":"brown wool",
             "desc":"Brown wool can be crafted by placing brown dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"golden apple",
             "desc":"A golden apple can be crafted by placing an apple in the very center square and eight gold ingots surrounding it."
          }
       ],
       [
          {
             "id":"birch leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"white wool",
             "desc":"White wool can be crated by placing four string in a two by two grid in a crafting window. It can also be obtained by placing bone meal next to any color wool in a crafting window"
          }
       ],
       [
          {
             "id":"purple carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"hardened clay",
             "desc":"Hardened clay can be crafted by smelting a clay block in a furnace."
          }
       ],
       [
          {
             "id":"zombie mob head",
             "desc":"Mob heads can be obtained by having a charged creeper blow up the mob whose head you want to obtain."
          }
       ],
       [
          {
             "id":"iron trapdoor",
             "desc":"An iron trapdoor can be crafted by placing iron ingots in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"flower pot",
             "desc":"A flower pot is crafted by placing three bricks in a V shape in a crafting table."
          }
       ],
       [
          {
             "id":"iron ore",
             "desc":"Iron ore can be obtained by breaking iron ore blocks with a stone pick ax or better"
          }
       ],
       [
          {
             "id":"jungle wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"birch wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"jungle door",
             "desc":"A Jungle Door can be crafted by placing six Jungle Planks down the first two columns."
          }
       ],
       [
          {
             "id":"golden ax",
             "desc":"All types of axes can be crafted by placing three of the desired materials in the top left, top middle, and middle left squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"packed ice",
             "desc":"Packed ice can be found in the rare ice plains spikes biome and can only be obtained with a silk touch tool."
          }
       ],
       [
          {
             "id":"bricks",
             "desc":"Bricks can be crafted by smelting clay in a furnace."
          }
       ],
       [
          {
             "id":"light blue carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"dead shrub",
             "desc":"Dead bushes, also known as shrubs, can be obtained with shears."
          }
       ],
       [
          {
             "id":"dropper",
             "desc":"A dropper can be crafted by placing red stone in the middle bottom square, and cobblestone in every other square but the center one."
          }
       ],
       [
          {
             "id":"chest",
             "desc":"A chest is crafted by placing wooden planks, in every square but the middle square, in a crafting table."
          }
       ],
       [
          {
             "id":"raw chicken",
             "desc":"Raw Chicken will drop from the death of a Chicken."
          }
       ],
       [
          {
             "id":"raw salmon",
             "desc":"Raw salmon is randomly obtained by fishing."
          }
       ],
       [
          {
             "id":"tripwire hook",
             "desc":"A tripwire hook can be crafted by placing an iron ingot on top of a stick on top of a wood plank in a crafting table."
          }
       ],
       [
          {
             "id":"oak wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"mine cart with command block",
             "desc":"A mine cart with a command block can not be obtained without cheats."
          }
       ],
       [
          {
             "id":"eye of ender",
             "desc":"An eye of ender can be crafted by placing blaze power next to an ender pearl in a crafting window."
          }
       ],
       [
          {
             "id":"block of coal",
             "desc":"A block of coal can be crafted by placing coal in a three by three grid in a crafting window."
          }
       ],
       [
          {
             "id":"nether star",
             "desc":"A Nether Star can be obtained by defeating the Wither."
          }
       ],
       [
          {
             "id":"gravel",
             "desc":"Gravel can be obtained by breaking gravel blocks"
          }
       ],
       [
          {
             "id":"blue wool",
             "desc":"Blue wool can be crafted by placing lapis lazuli next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"nether quartz",
             "desc":"Nether Quartz can be obtained by smelting Nether Quartz Ore in a furnace."
          }
       ],
       [
          {
             "id":"rotten flesh",
             "desc":"Rotten flesh can be randomly obtained by killing zombies."
          }
       ],
       [
          {
             "id":"magenta carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"white stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"birch fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"carrots",
             "desc":"Carrots can be rarely obtained by killing zombies or, they can be naturally found as crops in villages."
          }
       ],
       [
          {
             "id":"purple dye",
             "desc":"Purple dye can be crafted by placing lapis lazuli next to rose red in a crafting window."
          }
       ],
       [
          {
             "id":"lapis lazuli block",
             "desc":"A lapis lazuli block can be obtained by entirely filling a crafting table with lapis lazuli."
          }
       ],
       [
          {
             "id":"obsidian",
             "desc":"Obsidian can be mined with a diamond pick or created by placing water on top of lava. "
          }
       ],
       [
          {
             "id":"mellohi disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music discs are found in eight percent of dungeon chests."
          }
       ],
       [
          {
             "id":"gray wool",
             "desc":"Gray wool can be crafted by placing gray dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"trapped chest",
             "desc":"A trapped chest can be crafted by placing a tripwire hook next to a chest in a crafting window."
          }
       ],
       [
          {
             "id":"light gray stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"iron pick ax",
             "desc":"All types of pick axes can be crafted by placing three of the desired material across the top row, and then placing sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"red mushroom",
             "desc":"Red mushrooms can be found naturally in darkly lit areas, mushroom biomes, or the nether."
          }
       ],
       [
          {
             "id":"puffer fish",
             "desc":"A puffer fish can be randomly obtained by fishing."
          }
       ],
       [
          {
             "id":"emerald",
             "desc":"Emeralds can be obtained by harvesting emerald ore."
          }
       ],
       [
          {
             "id":"wooden shovel",
             "desc":"All types of shovels can be crafted by placing the desired material in the top middle square, and then sticks in the two squares directly beneath that in a crafting table."
          }
       ],
       [
          {
             "id":"golden helmet",
             "desc":"All helmets are crafted by placing the desired material in all squares but the very center square and the bottom row in a crafting table/"
          }
       ],
       [
          {
             "id":"melon",
             "desc":"A melon can be found naturally in jungles or can be grown from melon seeds found in chest mine carts in abandoned mine shafts."
          }
       ],
       [
          {
             "id":"clay block",
             "desc":"Clay is commonly found at the bottoms of rivers and lakes in shallow, circular patches. Clay blocks can also be found commonly in swamps."
          }
       ],
       [
          {
             "id":"anvil",
             "desc":"An anvil can be crafted by placing three blocks of iron across the top row, an iron ingot in the very center square, and then three iron ingots across the bottom row in a crafting table."
          }
       ],
       [
          {
             "id":"daylight sensor",
             "desc":"A daylight sensor can be crafted by placing three glass across the top row, three nether quartz across the middle grow, anad three wooden slabs across the bottom row in a crafting table."
          }
       ],
       [
          {
             "id":"lead",
             "desc":"A lead can be crafted by placing a slime ball in the very center, and then placing string in the top left, top middle, left middle, and bottom right squares in a crafting table."
          }
       ],
       [
          {
             "id":"sandstone",
             "desc":"Sandstone can be obtained in deserts or crafted by combining sand together in a two by two square."
          }
       ],
       [
          {
             "id":"leather tunic",
             "desc":"All chest pieces are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"black stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"lime stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"mine cart with t.n.t",
             "desc":"A Mine cart with T.N.T can be crafted by placing a T.N.T on top of a Mine cart in a crafting table."
          }
       ],
       [
          {
             "id":"clock",
             "desc":"A clock is crafted by placing red stone in the very center square and surrounding it with four gold ingots in a crafting table."
          }
       ],
       [
          {
             "id":"black carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"cocoa",
             "desc":"Cocoa beans come from cocoa pods, which are naturally found in jungle biomes. Cocoa beans are used as brown dye in minecraft."
          }
       ],
       [
          {
             "id":"gold ingot",
             "desc":"Gold ingots can be obtained by smelting gold ore in a furnace."
          }
       ],
       [
          {
             "id":"stone brick slab",
             "desc":"A stone brick slab can be crafted by placing three stone bricks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"clown fish",
             "desc":"A clown fish can be randomly obtained by fishing."
          }
       ],
       [
          {
             "id":"pumpkin seeds",
             "desc":"Pumpkin seeds can be crafted by placing a pumpkin in a crafting window."
          }
       ],
       [
          {
             "id":"mossy stone brick",
             "desc":"Mossy stone brick can be crafted by placing vines next to stone bricks in a crafting window. Mossy stone brick can also be found naturally in strongholds."
          }
       ],
       [
          {
             "id":"cobweb",
             "desc":"Cobwebs can be obtained by using shears or a sword that is enchanted with silk touch"
          }
       ],
       [
          {
             "id":"milk bucket",
             "desc":"A milk bucket can be obtained by right clicking on a cow with an iron bucket."
          }
       ],
       [
          {
             "id":"iron helmet",
             "desc":"All helmets are crafted by placing the desired material, in all squares but the very center square, and the bottom row, in a crafting table."
          }
       ],
       [
          {
             "id":"yellow stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"light gray stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"diamond",
             "desc":"Diamond can be obtained by breaking diamond ore with an iron pick ax or better."
          }
       ],
       [
          {
             "id":"stone sword",
             "desc":"All types of swords can be crafted by placing the desired material in the top middle and very center square, with a stick beneath them, in a crafting table"
          }
       ],
       [
          {
             "id":"cobblestone stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"bed",
             "desc":"A bed can be crafted by placing three wool across the top row and three wooden planks across the middle row in a crafting table."
          }
       ],
       [
          {
             "id":"birch wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"quartz slab",
             "desc":"A quartz slab can be crafted by placing three quartz blocks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"sponge",
             "desc":"Sponges can be obtained by killing an elder guardian or randomly finding them in ocean monuments"
          }
       ],
       [
          {
             "id":"skeleton mob head",
             "desc":"Mob heads can be obtained by having a charged creeper blow up the mob whose head you want to obtain."
          }
       ],
       [
          {
             "id":"bucket",
             "desc":"A bucket can be crafted by placing three iron ingots in a V shape in a crafting table."
          }
       ],
       [
          {
             "id":"diamond sword",
             "desc":"All types of swords can be crafted by placing the desired material in the top middle and very center square, with a stick beneath them, in a crafting table"
          }
       ],
       [
          {
             "id":"golden shovel",
             "desc":"All types of shovels can be crafted by placing the desired material in the top middle square, and then sticks in the two squares directly beneath that in a crafting table."
          }
       ],
       [
          {
             "id":"spruce wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"iron bars",
             "desc":"Iron bars can be crafted by placing six iron ingots across the bottom two rows in a crafting table. Iron bars can also be found naturally in strongholds."
          }
       ],
       [
          {
             "id":"raw rabbit",
             "desc":"Raw rabbit can be randomly obtained by killing a rabbit."
          }
       ],
       [
          {
             "id":"yellow carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"carrot on a stick",
             "desc":"A carrot on a stick can be crafted by placing a fishing pole in the middle left square and a carrot in the bottom middle square in a crafting window."
          }
       ],
       [
          {
             "id":"raw pork chop",
             "desc":"A raw pork chop can be obtained by killing a pig."
          }
       ],
       [
          {
             "id":"furnace",
             "desc":"A furnace can be crafted by placing cobblestone in every square but the middle square in a crafting table."
          }
       ],
       [
          {
             "id":"nether brick fence",
             "desc":"A nether brick fence can be crafted by placing six nether brick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"diamond horse armor",
             "desc":"Horse Armor can be randomly found in Dungeons, Nether fortresses, Village blacksmiths, jungle temples, desert temples, and stronghold chests."
          }
       ],
       [
          {
             "id":"red sandstone slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"birch wood plank",
             "desc":"Birch wood planks can be obtained by placing birch wood in a crafting table."
          }
       ],
       [
          {
             "id":"bedrock",
             "desc":"Bedrock can not be obtained by a player without cheats. It is the bottom most block in the game."
          }
       ],
       [
          {
             "id":"saddle",
             "desc":"Saddles can not be crafted and can only be obtained by finding them in chests inside dungeons, abandoned mine shafts, nether fortresses, desert temples, or jungle temples."
          }
       ],
       [
          {
             "id":"light gray dye",
             "desc":"Light gray dye can be crafted by placing two bone meal in a vertical row next to an ink sac in a crafting window."
          }
       ],
       [
          {
             "id":"jungle leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"blocks disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"pumpkin",
             "desc":"Pumpkins can be rarely be found on grass in most biomes."
          }
       ],
       [
          {
             "id":"baked potato",
             "desc":"A baked potato can be obtained by smelting a potato in a furnace."
          }
       ],
       [
          {
             "id":"leather",
             "desc":"Leather can be randomly obtained by killing cows or horses."
          }
       ],
       [
          {
             "id":"light gray carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"iron boots",
             "desc":"All boots are crafted by placing the desired material in the middle left, bottom left, middle right, and bottom right squares of a crafting table."
          }
       ],
       [
          {
             "id":"end stone",
             "desc":"End stone can be found naturally in the end dimension."
          }
       ],
       [
          {
             "id":"chainmail leggings",
             "desc":"Chainmail armor can only be obtained by trading with a villager or getting a rare drop off of a mob."
          }
       ],
       [
          {
             "id":"rabbit\"s foot",
             "desc":"A rabbit\"s foot can be obtained rarely by killing a rabbit."
          }
       ],
       [
          {
             "id":"glass",
             "desc":"Glass can be obtained by smelting sand in a furnace."
          }
       ],
       [
          {
             "id":"stone",
             "desc":"Stone can be made by smelting cobblestone in a furnace."
          }
       ],
       [
          {
             "id":"prismarine",
             "desc":"Prismarine can be crafted by placing prismarine shards in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"compass",
             "desc":"A compass is crafted by placing red stone in the very center square, and surrounding it with four iron ingots, in a crafting table."
          }
       ],
       [
          {
             "id":"green stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"gold leggings",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"command block",
             "desc":"Command blocks can not be obtained without cheats in minecraft."
          }
       ],
       [
          {
             "id":"dispenser",
             "desc":"A dispenser can be created by placing a bow in the very center square, red stone right beneath that, and cobblestone in every other square."
          }
       ],
       [
          {
             "id":"poisonous potato",
             "desc":"A poisonous potato will randomly be dropped when harvesting potatoes."
          }
       ],
       [
          {
             "id":"apple",
             "desc":"Apples randomly drop from oak and dark oak leaves. They can also be randomly found in chests in strongholds or villages."
          }
       ],
       [
          {
             "id":"red flower",
             "desc":"Poppies can be found naturally on grass or created randomly by using bone meal on grass."
          }
       ],
       [
          {
             "id":"magenta dye",
             "desc":"Magenta dye can be crafted by placing purple dye next to pink dye in a crafting window."
          }
       ],
       [
          {
             "id":"brown carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"prismarine shard",
             "desc":"Prismarine Shards can be obtained by defeating Guardians and Elder Guardians."
          }
       ],
       [
          {
             "id":"red stone block",
             "desc":"A red stone block can be crafted by placing nine red stone in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"yellow stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"dandelion yellow",
             "desc":"Dandelion yellow is the equivalent of yellow dye in minecraft. It can be crafted by placing a dandelion or a sunflower in a crafting window."
          }
       ],
       [
          {
             "id":"acacia wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares."
          }
       ],
       [
          {
             "id":"sandstone slab",
             "desc":"A sandstone slab can be crated by placing three sandstone blocks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"gray carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"polished granite",
             "desc":"Polished Granite can be crafted by placing four granite in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"mine cart",
             "desc":"A mine cart is crafted by placing five iron ingots in a U shape in a crafting table."
          }
       ],
       [
          {
             "id":"brown stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"cyan stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"book",
             "desc":"A book is crafted by creating a two by two grid where the bottom right square is leather and all other squares are paper in a crafting window."
          }
       ],
       [
          {
             "id":"mine cart with a chest",
             "desc":"A mine cart with a chest is crafted by placing a chest on top of a mine cart in a crafting window."
          }
       ],
       [
          {
             "id":"acacia sapling",
             "desc":"Acacia saplings can be randomly obtained by breaking acacia leaves."
          }
       ],
       [
          {
             "id":"paper",
             "desc":"Paper is crafted by placing three sugar cane, across a row, in a crafting table."
          }
       ],
       [
          {
             "id":"gold chest plate",
             "desc":"All chest plates are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"cyan stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"mushroom stew",
             "desc":"Mushroom stew is crafted by placing a red mushroom in the middle left square, a brown mushroom in the very center square, and a bowl in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"nether brick",
             "desc":"Nether Brick can be mined with a pick ax, or crafted by placing four Nether Bricks in a two by two square in a crafting table."
          }
       ],
       [
          {
             "id":"magma cream",
             "desc":"Magma cream can be crafted by placing blaze powder next to a slime ball in a crafting window."
          }
       ],
       [
          {
             "id":"snow",
             "desc":"Snow can be crafted by placing snowballs in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"orange dye",
             "desc":"Orange dye can be crafted by placing rose red next to dandelion yellow in a crafting window."
          }
       ],
       [
          {
             "id":"potion",
             "desc":"A potion is created by utilizing a brewing stand, cauldron, and water bottles."
          }
       ],
       [
          {
             "id":"lime stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"white stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"boat",
             "desc":"A boat can be obtained by making a U shape with five wooden planks."
          }
       ],
       [
          {
             "id":"dark prismarine",
             "desc":"Dark prismarine can be crafted by placing an ink sac in the very center square, and then eight placing prismarine shards around it."
          }
       ],
       [
          {
             "id":"oak door",
             "desc":"A Oak Door can be crafted by placing six Oak Planks down the first two columns."
          }
       ],
       [
          {
             "id":"cocoa beans",
             "desc":"Cocoa beans come from cocoa pods, which are naturally found in jungle biomes. Cocoa beans are used as brown dye in minecraft."
          }
       ],
       [
          {
             "id":"oak wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"red wool",
             "desc":"Red wool can be crafted by placing rose red next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"cooked mutton",
             "desc":"Cooked mutton can be obtained by cooking raw mutton in a furnace. Alternately, one to two pieces of Cooked Mutton are dropped when a sheep dies while on fire."
          }
       ],
       [
          {
             "id":"dark oak fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"iron door",
             "desc":"An Iron Door can be crafted by placing six Iron Ingots down the first two columns."
          }
       ],
       [
          {
             "id":"painting",
             "desc":"A painting is crafted by placing wool in the very center square and surrounding it with eight sticks."
          }
       ],
       [
          {
             "id":"spruce leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"pink stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"acacia wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"dark oak wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"chiseled sandstone",
             "desc":"Chiseled sandstone can be created by placing a sandstone slab on top of a sandstone slab, in a crafting window."
          }
       ],
       [
          {
             "id":"oak wood plank",
             "desc":"Oak wood planks can be obtained by placing oak wood in a crafting table."
          }
       ],
       [
          {
             "id":"cooked salmon",
             "desc":"Cooked salmon is obtained by cooking salmon in a furnace."
          }
       ],
       [
          {
             "id":"iron shovel",
             "desc":"All types of shovels can be crafted by placing the desired material in the top middle square, and then sticks in the two squares directly beneath that in a crafting table."
          }
       ],
       [
          {
             "id":"enchanting table",
             "desc":"An enchanting table can be crafted by placing a book in the top middle square, diamonds in the middle left and middle right squares, and obsidian in the very center and across the bottom row, in a crafting table."
          }
       ],
       [
          {
             "id":"red stone repeater",
             "desc":"A red stone repeater can be crafted by placing smooth stone in all three squares across the bottom row, red stone in the very middle square, and red stone torches on both sides of the red stone."
          }
       ],
       [
          {
             "id":"far disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"green carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"iron ingot",
             "desc":"Iron ingots can be obtained by smelting iron ore in a furnace."
          }
       ],
       [
          {
             "id":"orange wool",
             "desc":"Orange wool can be crafted by placing orange dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"jungle sapling",
             "desc":"Jungle saplings can be randomly obtained by breaking jungle leaves."
          }
       ],
       [
          {
             "id":"stone slab",
             "desc":"A stone slab can be crafted by placing three stone blocks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"light blue stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"cyan dye",
             "desc":"Cyan dye can be crafted by placing lapis lazuli next to cactus green in a crafting window."
          }
       ],
       [
          {
             "id":"steak",
             "desc":"Raw Beef can be cooked into Steak by smelting it in a furnace. Alternately, Steak has a chance of dropping when a Cow or Moo shroom dies while on fire."
          }
       ],
       [
          {
             "id":"orange stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"blue stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"spruce fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"coal",
             "desc":"Coal can be obtained by breaking a coal ore block with a wooden pick ax or better."
          }
       ],
       [
          {
             "id":"potatoes",
             "desc":"Potatoes can be rarely obtained by killing zombies or, they can be found as crops in villages."
          }
       ],
       [
          {
             "id":"light gray stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"egg",
             "desc":"Eggs are randomly produced by chickens. Throwing an egg has a chance to create a new chicken."
          }
       ],
       [
          {
             "id":"spruce wood plank",
             "desc":"Spruce wood planks can be obtained by placing spruce wood in a crafting table."
          }
       ],
       [
          {
             "id":"orange stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"acacia wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"light gray wool",
             "desc":"Light gray wool can be crafted by placing light gray dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"hay bale",
             "desc":"A hay bale can be crafted by placing wheat in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"clay",
             "desc":"Clay is obtained by breaking clay blocks with a non silk touch tool."
          }
       ],
       [
          {
             "id":"bowl",
             "desc":"A bowl can be crafted by placing three wooden planks in a v shape in a crafting table."
          }
       ],
       [
          {
             "id":"leather helmet",
             "desc":"All helmets are crafted by placing the desired material in all squares but the very center square and the bottom row in a crafting table"
          }
       ],
       [
          {
             "id":"pink stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"diamond chest plate",
             "desc":"All chest plates are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"gray stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"yellow stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"snowman",
             "desc":"A snow golem can be created by placing a pumpkin on top of  two snow blocks on the ground."
          }
       ],
       [
          {
             "id":"diamond ore",
             "desc":"Diamond ore can be found in the bottom sixteen layers on the map. One can break diamond ore with an iron pick ax or better. This will cause the diamond ore to break into a diamond. To obtain the ore, you will need to use a pick ax with the silk touch enchant."
          }
       ],
       [
          {
             "id":"banner",
             "desc":"A Banner can be crafted by placing six wool across the top two rows, then placing a stick on the bottom middle. The banner will take on the color of the wool you choose."
          }
       ],
       [
          {
             "id":"stone ax",
             "desc":"All types of axes can be crafted by placing three of the desired material in the top left, top middle, and middle left squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"firework star",
             "desc":"A firework star can be crafted by placing gunpower in the middle left square and any color dye in the center square in a crafting table. A firework star can also be crafted with optional ingredients such as diamonds, glow stone dust, or feathers, that are placed directly beneath the dye in a crafting table."
          }
       ],
       [
          {
             "id":"nether wart",
             "desc":"Nether warts can be naturally found in nether fortresses as a plant."
          }
       ],
       [
          {
             "id":"red stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"quartz block",
             "desc":"A quartz block can be crafted by placing four nether quartz in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"poppy",
             "desc":"Poppies can be found naturally on grass or created randomly by using bone meal on grass."
          }
       ],
       [
          {
             "id":"acacia fence",
             "desc":"Any type of fence can be crafted by putting a wooden plank, a stick, and then another wooden plank in the bottom two rows of a crafting table."
          }
       ],
       [
          {
             "id":"cactus",
             "desc":"Cactus can be found naturally in desert biomes. "
          }
       ],
       [
          {
             "id":"spruce door",
             "desc":"A Spruce Door can be crafted by placing six Spruce Planks down the first two columns."
          }
       ],
       [
          {
             "id":"cat disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"flint and steel",
             "desc":"Flint and steel can be crafted by placing an iron ingot to the left of flint in a crafting window."
          }
       ],
       [
          {
             "id":"gold pants",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"slime ball",
             "desc":"Slime balls are randomly dropped by killing slimes."
          }
       ],
       [
          {
             "id":"cooked porkchop",
             "desc":"A cooked porkchop can be obtained by cooking a raw porkchop in a furnace or by lighting a pig on fire."
          }
       ],
       [
          {
             "id":"polished andesite",
             "desc":"Polished Andesite can be crafted by placing four andesite in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"prismarine bricks",
             "desc":"Prismarine bricks can be crafted by placing prismarine shards in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"wither",
             "desc":"A wither can be created by placing three wither skulls on top of soul sand that is placed on the ground in a T shape."
          }
       ],
       [
          {
             "id":"lime dye",
             "desc":"Lime dye can be crafted by placing cactus green next to bone meal in a crafting window."
          }
       ],
       [
          {
             "id":"blue carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"door",
             "desc":"A door can be crafted by placing six Planks, down the first two columns, in a crafting table."
          }
       ],
       [
          {
             "id":"tripwire",
             "desc":"Tripwire is simply string next to a tripwire hook."
          }
       ],
       [
          {
             "id":"enchantment table",
             "desc":"An enchantment table can be crafted by placing a book in the top middle square, diamonds in the middle left and middle right squares, and obsidian in the very center and across the bottom row, in a crafting table."
          }
       ],
       [
          {
             "id":"cyan carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"polished diorite",
             "desc":"Polished Diorite can be crafted by placing four diorite in a two by two grid in a crafting table."
          }
       ],
       [
          {
             "id":"golden boots",
             "desc":"All boots are crafted by placing the desired material in the middle left, bottom left, middle right, and bottom right squares of a crafting table."
          }
       ],
       [
          {
             "id":"iron block",
             "desc":"An iron block can be crafted by placing iron ingots in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"acacia leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"dark oak sapling",
             "desc":"Dark oak saplings can be randomly obtained by breaking dark oak leaves"
          }
       ],
       [
          {
             "id":"diamond hoe",
             "desc":"All types of hoes can be crafted by placing two of the desired material in the top left, and top middle squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"dandelion",
             "desc":"Dandelions can be found naturally on grass or created randomly by using bone meal on grass."
          }
       ],
       [
          {
             "id":"lapis lazuli",
             "desc":"Can be obtained by breaking lapis lazuli ore with a stone pick ax or better"
          }
       ],
       [
          {
             "id":"sugar cane",
             "desc":"Sugar cane can be found naturally near water,"
          }
       ],
       [
          {
             "id":"birch door",
             "desc":"A Birch Door can be crafted by placing six Birch Planks down the first two columns."
          }
       ],
       [
          {
             "id":"cactus green",
             "desc":"Cactus green can be crafted by smelting a cactus in a furnace."
          }
       ],
       [
          {
             "id":"gold block",
             "desc":"A gold block can be crafted by placing gold ingots in a three by three grid in a crafting table."
          }
       ],
       [
          {
             "id":"smooth sandstone",
             "desc":"Smooth sandstone can be created by placing sandstone in a two by two grid in a crafting window"
          }
       ],
       [
          {
             "id":"magenta stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"note block",
             "desc":"A note block is crafted by placing red stone in the very center square and wooden planks all around that in a crafting table"
          }
       ],
       [
          {
             "id":"snow block",
             "desc":"Snow can be crafted by placing snowballs in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"mob head",
             "desc":"Mob heads can be obtained by having a charged creeper blow up the mob whose head you want to obtain."
          }
       ],
       [
          {
             "id":"diamond leggings",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"red sandstone",
             "desc":"Red sandstone can be crafted by placing four red sand in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"orange stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"slime block",
             "desc":"A slime block can be crafted by placing slime balls in a three by three grid in a crafting window."
          }
       ],
       [
          {
             "id":"bookshelf",
             "desc":"A bookshelf is crafted by placing books across the middle row and wooden planks across the top and bottom rows"
          }
       ],
       [
          {
             "id":"cake",
             "desc":"Cake can be crafted by placing three buckets of milk across the top row, sugar in the left middle, and right middle squares, an egg in the very center square, and three wheat across the bottom squares in a crafting table."
          }
       ],
       [
          {
             "id":"wooden button",
             "desc":"A wooden button can be crafted by placing a single wooden plank in a crafting window."
          }
       ],
       [
          {
             "id":"chiseled quartz block",
             "desc":"A chiseled quartz block can be obtained by placing a quartz slab on top of a quartz slab in a crafting table."
          }
       ],
       [
          {
             "id":"stone button",
             "desc":"A stone button can be crafted by placing a single piece of smooth stone in a crafting window."
          }
       ],
       [
          {
             "id":"glow stone dust",
             "desc":"Glow stone dust is obtained by breaking glow stone blocks."
          }
       ],
       [
          {
             "id":"lime stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"cobblestone wall",
             "desc":"A cobblestone wall is crafted by placing six cobblestone across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"name tag",
             "desc":"Name Tags can only be obtained in three ways. The first way is by finding it in a Dungeon chest. The second way is by fishing. The last way Name Tags can be obtained is by trading with the Librarian Villagers for twenty to twenty two Emeralds."
          }
       ],
       [
          {
             "id":"gunpowder",
             "desc":"Gunpowder can be randomly obtained by killing creepers."
          }
       ],
       [
          {
             "id":"blaze powder",
             "desc":"Blaze powder can be obtained by placing a blaze row in a crafting window."
          }
       ],
       [
          {
             "id":"brewing stand",
             "desc":"A brewing stand can be crafted by placing a blaze rod in the center square, and three cobblestone across the bottom row in a crafting table."
          }
       ],
       [
          {
             "id":"torch",
             "desc":"A torch can be crafted by placing a piece of coal on top of a stick."
          }
       ],
       [
          {
             "id":"yellow wool",
             "desc":"Yellow wool can be crafted by placing dandelion yellow next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"watermelon",
             "desc":"A melon can be found naturally in jungles or can be grown from melon seeds found in chest minecarts in abandoned mine shafts."
          }
       ],
       [
          {
             "id":"wait disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"glistering melon",
             "desc":"A glistering melon can be crafted by placing a melon in the very center square and surrounding it with eight gold nuggets in a crafting table."
          }
       ],
       [
          {
             "id":"netherrack",
             "desc":"Netherrack can be found commonly throughout the Nether dimension."
          }
       ],
       [
          {
             "id":"leather chest plate",
             "desc":"All chest places are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"wooden slab",
             "desc":"A wooden slab can be crafted by placing three wooden planks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"nether brick stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"ice",
             "desc":"Ice can be found naturally in snow biomes. If broken, or placed near a heat source, ice will turn into water. To obtain an ice block, one would need to mine it with a silk touch pick ax."
          }
       ],
       [
          {
             "id":"large fern",
             "desc":"Large ferns are naturally found in jungle, taiga, and mega taiga biomes."
          }
       ],
       [
          {
             "id":"nether brick slab",
             "desc":"A nether brick slab can be crafted by placing three nether brick in a row in a crafting table."
          }
       ],
       [
          {
             "id":"spruce wood slab",
             "desc":"All types of slabs can be crafted by placing three of the desired materials across a row in a crafting table."
          }
       ],
       [
          {
             "id":"iron hoe",
             "desc":"All types of hoes can be crafted by placing two of the desired material in the top left, and top middle squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"fern",
             "desc":"Ferns are naturally found in jungle, taiga, and mega taiga biomes."
          }
       ],
       [
          {
             "id":"sea lantern",
             "desc":"A sea lantern can be crafted by placing prismarine shards in the four corners of a crafting table, and then placing prismarine crystals in every other square."
          }
       ],
       [
          {
             "id":"cookie",
             "desc":"A cookie can be crafted by placing wheat, horizontally, on both sides of cocoa beans in a crafting table."
          }
       ],
       [
          {
             "id":"melon seeds",
             "desc":"Melon seeds can be crafted by placing a slice of melon in a crafting window."
          }
       ],
       [
          {
             "id":"gold nugget",
             "desc":"A gold nugget can be crafted by placing a single gold ingot into a crafting window. They can also be randomly obtained by killing a zombie pig men."
          }
       ],
       [
          {
             "id":"red stone ore block",
             "desc":"Redstone ore can be found in the bottom sixteen layers on the map. If broken with an iron pick ax or better, it will drop some amount of red stone. To obtain the ore itself, one would need to use a pick ax with a silk touch enchant."
          }
       ],
       [
          {
             "id":"diamond helmet",
             "desc":"All helmets are crafted by placing the desired material in all squares but the very center square and the bottom row in a crafting table."
          }
       ],
       [
          {
             "id":"spruce fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"golden hoe",
             "desc":"All types of hoes can be crafted by placing two of the desired material in the top left, and top middle squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"acacia wood plank",
             "desc":"Acacia wood planks can be obtained by placing acacia wood in a crafting table"
          }
       ],
       [
          {
             "id":"diamond pick ax",
             "desc":"All types of pick axes can be crafted by placing three of the desired material across the top row, and then placing sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"lapis lazuli ore",
             "desc":"Lapis Lazuli Ore can be only be obtained by using a pick ax with the silk touch enchant."
          }
       ],
       [
          {
             "id":"raw mutton",
             "desc":"Raw mutton can be obtained by killing a sheep."
          }
       ],
       [
          {
             "id":"quartz stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"brick block",
             "desc":"A brick block can be crafted by placing clay bricks in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"cobblestone slab",
             "desc":"A cobblestone slab can be crafted by placing three cobblestone blocks in a row in a crafting table."
          }
       ],
       [
          {
             "id":"emerald ore",
             "desc":"Emerald ore can only be found in extreme hills biomes between layers four and thirty-two. It can be mined with an iron pick ax or better to obtain an emerald. To obtain the ore itself, you will need a silk touch pick ax."
          }
       ],
       [
          {
             "id":"yellow flower",
             "desc":"Dandelions can be found naturally on grass or created randomly by using bone meal on grass."
          }
       ],
       [
          {
             "id":"jack o\"lantern",
             "desc":"A jack o\"lantern can be crafted by placing a pumpkin on top of a torch in a crafting table."
          }
       ],
       [
          {
             "id":"red stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"iron leggings",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"pink stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"black dye",
             "desc":"An ink sack is used as black dye in mine craft."
          }
       ],
       [
          {
             "id":"wooden hoe",
             "desc":"All types of hoes can be crafted by placing two of the desired material in the top left, and top middle squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"purple stained glass",
             "desc":"Any type of stained glass can be crafted by placing the desired color dye in the center square, and glass surrounding that."
          }
       ],
       [
          {
             "id":"mine cart with chest",
             "desc":"A mine cart with a chest is crafted by placing a chest on top of a mine cart in a crafting window."
          }
       ],
       [
          {
             "id":"detector rail",
             "desc":"A detector rail can be crafted by placing a stone pressure plate in the very center square, red stone in the bottom middle square, and iron ingots in the far left and far right columns"
          }
       ],
       [
          {
             "id":"cyan wool",
             "desc":"Cyan wool can be crafted by placing cyan dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"iron chestplate",
             "desc":"All chestplates are crafted by placing the desired material in all squares but the top middle square in a crafting table."
          }
       ],
       [
          {
             "id":"cobblestone",
             "desc":"Cobblestone can be obtained by breaking stone with a pick ax."
          }
       ],
       [
          {
             "id":"dark oak wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares."
          }
       ],
       [
          {
             "id":"creeper mob head",
             "desc":"Mob heads can be obtained by having a charged creeper blow up the mob whose head you want to obtain."
          }
       ],
       [
          {
             "id":"carrot",
             "desc":"Carrots can be rarely obtained by killing zombies or, they can be naturally found as crops in villages."
          }
       ],
       [
          {
             "id":"rabbit hide",
             "desc":"Rabbit hide can be randomly obtained by killing a rabbit."
          }
       ],
       [
          {
             "id":"grass",
             "desc":"When harvested with a regular shovel, grass turns into dirt. In order to obtain a grass block you will need to have a shovel with the silk touch enchant."
          }
       ],
       [
          {
             "id":"strad disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"birch sapling",
             "desc":"Birch saplings can be randomly obtained by breaking birch leaves."
          }
       ],
       [
          {
             "id":"mossy stone",
             "desc":"Mossy stone can be crafted by placing vines next to cobblestone in a crafting table. It can also be found naturally in various dungeons."
          }
       ],
       [
          {
             "id":"pink dye",
             "desc":"Pink dye can be crafted by placing bone meal next to rose red in a crafting window."
          }
       ],
       [
          {
             "id":"red stone torch",
             "desc":"A red stone torch is crafted by placing red stone on top of a torch in a crafting window."
          }
       ],
       [
          {
             "id":"green stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"tall grass",
             "desc":"Tall grass, which is called grass in a players inventory, spawns on grass blacks in certain biomes. Bonemeal can be used on a grass block to grow tall grass and occasionally flowers."
          }
       ],
       [
          {
             "id":"black wool",
             "desc":"Black wool can be crafted by placing an ink sac next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"wheat crops",
             "desc":"Wheat can be found naturally in villages or can be grown from seeds that one can obtain by breaking tall grass."
          }
       ],
       [
          {
             "id":"ender pearl",
             "desc":"Ender pearls can be randomly obtained by killing ender men."
          }
       ],
       [
          {
             "id":"moss stone",
             "desc":"Moss stone can be crafted by placing vines next to cobblestone in a crafting table. It can also be found naturally in various dungeons."
          }
       ],
       [
          {
             "id":"fishing rod",
             "desc":"A fishing rod is crafted by placing three sticks in a diagonal line, and then two string beneath the top right stick in a crafting window."
          }
       ],
       [
          {
             "id":"bone meal",
             "desc":"Bone meal can be crafted by placing a bone into a crafting window."
          }
       ],
       [
          {
             "id":"quartz",
             "desc":"Nether Quartz can be obtained by smelting Nether Quartz Ore in a furnace."
          }
       ],
       [
          {
             "id":"dark oak wood plank",
             "desc":"Dark oak wood planks can be obtained by placing dark oak wood in a crafting table."
          }
       ],
       [
          {
             "id":"powered rail",
             "desc":"A powered rail can be crafted by placing a stick in the very center square, red stone in the bottom middle square, and gold ingots in the far left and far right columns"
          }
       ],
       [
          {
             "id":"beacon",
             "desc":"A beacon can be obtained by placing a nether star in the very center square, three obsidian across the bottom row, and five glass in the remaining squares in a crafting table."
          }
       ],
       [
          {
             "id":"blue stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"dark oak door",
             "desc":"A Dark Oak Door can be crafted by placing six Dark Oak Planks down the first two columns."
          }
       ],
       [
          {
             "id":"iron golem",
             "desc":"An iron golem can be created by similarly to a snow golem. Place a pumpkin head on top of two iron blocks. Then place two more iron blocks on either side of the very center iron block."
          }
       ],
       [
          {
             "id":"spruce wood",
             "desc":"All types of wood can be obtained by breaking the tree they naturally grow into."
          }
       ],
       [
          {
             "id":"pink wool",
             "desc":"Pink wool can be crafted by placing pink dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"fire charge",
             "desc":"A fire charge can be crafted by placing blaze powder in the middle left square, coal in the very center square, and gunpowder in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"acacia door",
             "desc":"An Acacia Door can be crafted by placing six Acacia Planks down the first two columns."
          }
       ],
       [
          {
             "id":"iron pants",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"chirp disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"oak leaves",
             "desc":"All leaves can be obtained by using a shear on the desired leaf."
          }
       ],
       [
          {
             "id":"arrow",
             "desc":"An arrow can be crafted by placing flint in the top middle square, a stick in the very center square, and a feather in the bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"wooden ax",
             "desc":"All types of axes can be crafted by placing three of the desired material in the top left, top middle, and middle left squares, with sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"glass pane",
             "desc":"A glass pane can be crafted by placing six glass blocks across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"gold helmet",
             "desc":"All helmets are crafted by placing the desired material in all squares but the very center square and the bottom row in a crafting table."
          }
       ],
       [
          {
             "id":"ender chest",
             "desc":"An ender chest can be crafted by placing an eye of ender in the center square, and then surrounding that with eight obsidian blocks in a crafting table."
          }
       ],
       [
          {
             "id":"light blue wool",
             "desc":"Light blue wool can be crafted by placing light blue dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"string",
             "desc":"String can be randomly obtained by killing spiders or by breaking cobwebs."
          }
       ],
       [
          {
             "id":"red sandstone stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"purple wool",
             "desc":"Purple wool can be crafted by placing purple dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"cyan stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ],
       [
          {
             "id":"black stained clay",
             "desc":"Any type of stained clay can be crafted by placing the appropriate dye in the center square and hardened clay surrounding it."
          }
       ],
       [
          {
             "id":"enchanted book",
             "desc":"Enchanted books can be found in chests located in dungeons, strongholds, desert temples, jungle temples, and mine shafts."
          }
       ],
       [
          {
             "id":"button",
             "desc":"A button can be crafted by placing either a single piece of smooth stone or a single wooden plank in a crafting window."
          }
       ],
       [
          {
             "id":"lime wool",
             "desc":"Lime wool can be crafted by placing lime dye next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"coarse dirt",
             "desc":"Coarse dirt can be obtained by breaking dirt in the Mega Taiga, Mesa, or Savanna biomes."
          }
       ],
       [
          {
             "id":"ghast tear",
             "desc":"Ghast tears can be rarely obtained by killing ghasts."
          }
       ],
       [
          {
             "id":"mine cart with a furnace",
             "desc":"A mine cart with a furnace is crafted by placing a furnace on top of a mine cart in a crafting window."
          }
       ],
       [
          {
             "id":"wheat",
             "desc":"Wheat can be found naturally in villages or can be grown from seeds that one can obtain by breaking tall grass."
          }
       ],
       [
          {
             "id":"soul sand",
             "desc":"Soul sand can be found commonly throughout the Nether dimension."
          }
       ],
       [
          {
             "id":"brown mushroom",
             "desc":"Brown mushrooms can be found naturally in darkly lit areas, mushroom biomes, or the nether."
          }
       ],
       [
          {
             "id":"chainmail helmet",
             "desc":"Chainmail armor can only be obtained by trading with a villager or getting a rare drop off of a mob."
          }
       ],
       [
          {
             "id":"written book",
             "desc":"A written book is created after a book and quill is signed."
          }
       ],
       [
          {
             "id":"spruce sapling",
             "desc":"Spruce saplings can be randomly obtained by breaking spruce leaves."
          }
       ],
       [
          {
             "id":"oak sapling",
             "desc":"Oak saplings can be randomly obtained by breaking oak leaves."
          }
       ],
       [
          {
             "id":"inverted daylight sensor",
             "desc":"An inverted daylight sensor can be created by right clicking on a daylight sensor."
          }
       ],
       [
          {
             "id":"sandstone stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"red stone lamp",
             "desc":"A red stone lamp can be crafted by placing glow stone in the very center square, and surrounding it with four red stone in a crafting table."
          }
       ],
       [
          {
             "id":"crafting table",
             "desc":"A crafting table is crafted by placing wooden planks in a two by two grid in a crafting window."
          }
       ],
       [
          {
             "id":"glow stone",
             "desc":"Glow stone can be found on the ceiling in the Nether dimension."
          }
       ],
       [
          {
             "id":"wooden pressure plate",
             "desc":"A wooden pressure plate can be created by placing two wooden planks, horizontally, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"charcoal",
             "desc":"Charcoal can be obtained by burning wood blocks in a furnace."
          }
       ],
       [
          {
             "id":"chainmail boots",
             "desc":"Chainmail armor can only be obtained by trading with a villager or getting a rare drop off of a mob."
          }
       ],
       [
          {
             "id":"ladder",
             "desc":"A ladder is crafted by placing sticks in every square but the top middle and bottom middle square."
          }
       ],
       [
          {
             "id":"mossy cobblestone",
             "desc":"Mossy cobblestone can be crafted by placing vines next to cobblestone in a crafting table. It can also be found naturally in various dungeons."
          }
       ],
       [
          {
             "id":"golden pick ax",
             "desc":"All types of pick axes can be crafted by placing three of the desired material across the top row, and then placing sticks in the center and bottom middle squares in a crafting table."
          }
       ],
       [
          {
             "id":"seeds",
             "desc":"Wheat seeds can be randomly found by breaking tall grass."
          }
       ],
       [
          {
             "id":"acacia fence gate",
             "desc":"Any type of fence gate can be crafted by placing a stick, a wooden plank, and then another stick across the bottom two rows in a crafting table."
          }
       ],
       [
          {
             "id":"birch wood stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"ward disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"music disc",
             "desc":"A random music disc has a possibility of dropping when a Skeleton\"s Arrow kills a Creeper. Alternately, music disc are found in eight percent of dungeon chest."
          }
       ],
       [
          {
             "id":"enchanted golden apple",
             "desc":"An enchanted golden apple is crafted by placing an apple in the very center square and surrounding it with eight gold blocks."
          }
       ],
       [
          {
             "id":"white carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"iron sword",
             "desc":"All types of swords can be crafted by placing the desired material in the top middle and very center square, with a stick beneath them, in a crafting table"
          }
       ],
       [
          {
             "id":"diamonds pants",
             "desc":"All leggings are crafted by placing the desired material in all squares but the center square and bottom middle square in a crafting table."
          }
       ],
       [
          {
             "id":"chiseled red sandstone",
             "desc":"Chiseled red sandstone can be crafted by placing a red sandstone slab on top of a red sandstone slab in a crafting window."
          }
       ],
       [
          {
             "id":"stone brick stairs",
             "desc":"All types of stairs can be crafted by placing the desired material in all squares but the top middle, top right, and middle right squares in a crafting table."
          }
       ],
       [
          {
             "id":"pressure plate",
             "desc":"A pressure plate can be created by placing either two smooth stone or two wooden planks next to each other, horizontally, in a crafting window."
          }
       ],
       [
          {
             "id":"jungle wood plank",
             "desc":"Jungle wood planks can be obtained by placing jungle wood in a crafting table"
          }
       ],
       [
          {
             "id":"green wool",
             "desc":"Green wool can be crafted by placing cactus green next to any color wool in a crafting window."
          }
       ],
       [
          {
             "id":"sugar canes",
             "desc":"Sugar canes occur naturally near water."
          }
       ],
       [
          {
             "id":"bow",
             "desc":"A bow can be crafted by placing three string in the rightmost column and then placing tree sticks in a less than sign pattern next to the string in a crafting table."
          }
       ],
       [
          {
             "id":"lime carpet",
             "desc":"Any type of carpet can be crafted by placing two wool, of the same color, next to each other in a crafting window."
          }
       ],
       [
          {
             "id":"flint",
             "desc":"Flint is randomly dropped while breaking gravel."
          }
       ],
       [
          {
             "id":"black stained glass pane",
             "desc":"Any type of stained glass pane can be crafted by placing the same color stained glass, horizontally, in the bottom two rows."
          }
       ]
    ]
 }